[
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 1/1.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 1/1.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Employee relations form the bedrock of our school culture, defining how we engage not only with our leadership but with each other, other staff, and most importantly, our students. Every relationship, whether between employer and employee, amongst colleagues, or between staff and students, has a direct impact on our school’s overall success and well-being.",
          "Strong employee relations are not just about maintaining a positive work environment but are foundational to the long-term success and reputation of any educational institution, especially one like Caelum, which is deeply rooted in fostering a culture of happiness and emotional well-being. For investors or franchise owners considering opening a Caelum branch, it is crucial to understand the importance of structured employee relations. A school thrives when its staff is engaged, motivated, and aligned with the values that the institution stands for. Research indicates that schools with higher teacher engagement show a 20% improvement in student performance (Gallup, 2018). Furthermore, ensuring that the school adheres to local labour laws and provides comprehensive support systems to its staff will foster a work culture that attracts top talent and retains employees for the long term.",
          "As an ICSE (Indian Certificate of Secondary Education) school, Caelum adheres to the high standards set by the council in both academics and staff management. The ICSE board emphasises a well-rounded education that not only focuses on academic excellence but also the holistic development of students. To meet these objectives, it is crucial that schools create and maintain an environment where teachers and other staff members feel supported, engaged, and aligned with the school’s vision. At Caelum, we meet and exceed ICSE requirements by integrating our philosophy of doing sustainable things consistently rather than focusing on unrealistic, one-off efforts."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 1/2.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 1/2.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "The Caelum Code of Conduct is more than a list of rules—it's a reflection of our values and commitment to excellence. Rooted in the Caelum Way, our code outlines the expected behaviours, ethical standards, and responsibilities of all staff members. Many researches indicate that clear behavioural expectations reduce workplace conflict by significantly.",
          "Clear Expectations: The Code of Conduct is designed to foster integrity, responsibility, and mutual respect. It is communicated to all staff members, ensuring that they understand not only the standards required of them but also how these align with our child-centred approach.",
          "Training and Awareness: Each employee undergoes training on the code, offering real-life examples and case studies to ensure clarity in expectations. This ensures that our values permeate every decision and interaction within the school.",
          "Positive Reinforcement: We emphasise continuous dialogue around ethics, celebrating employees who exemplify the code’s principles, thus reinforcing positive behaviour and creating an environment of trust and collaboration."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 1/3.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 1/3.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Open and Impartial Process: Our grievance procedure is designed to be fair and transparent, encouraging employees to voice their concerns without fear of retaliation.",
          "Prompt Resolution: We prioritise resolving issues swiftly, investigating complaints with impartiality, while also ensuring that our procedures align with Indian labour laws.",
          "Cultural Sensitivity: Our approach is rooted in the values of empathy and collaboration, ensuring that we not only address concerns but also maintain a supportive and respectful environment."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 1/4.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 1/4.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          " Research from the American Psychological Association (2019) indicates that workplaces that actively support mental well-being report a 22% increase in productivity, and a 19% reduction in absenteeism. We know, understand and empathise with the fact that personal well-being is fundamental to professional success.",
          "Mental Health Support: EAPs provide confidential counselling services, covering issues such as stress, anxiety, work-life balance, and family concerns. With rising awareness of mental health, we aim to ensure our staff have the resources to take care of themselves.",
          "Accessibility: EAPs are available to all employees, and we provide comprehensive communication around these services through newsletters, orientation programs, and regular staff meetings.",
          "Cultural Sensitivity: Understanding the diverse backgrounds of our employees, the EAPs are culturally sensitive, ensuring that everyone receives personalised support that resonates with their cultural values."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 1/5.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 1/5.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "A healthy work environment is one where all forms of harassment and discrimination are unequivocally prohibited. According to a study by the International Labor Organization (ILO), workplaces that have and implement anti-harassment policies properly, report 30% greater employee satisfaction and a sense of security, leading to better retention and overall morale. Our anti-harassment policy ensures that Caelum remains a safe space for all employees and students.",
          "Zero Tolerance: The policy explicitly prohibits harassment based on gender, ethnicity, age, disability, religion, or any other characteristic, ensuring a work environment free from any form of discrimination.",
          "Clear Reporting Mechanism: Employees are educated about how to report incidents safely and discreetly. Complaints are investigated with urgency, ensuring impartiality and respect throughout the process.",
          "Ongoing Education: We conduct regular training sessions on recognizing and preventing harassment. These sessions are designed to ensure that all employees understand the nuances of acceptable workplace behavior, as well as the profound impact their actions can have on colleagues and students alike."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 1/6.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 1/6.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          " Employer-Employee Relations: We want employer-employee relations to extend beyond managerial oversight. We look at it as a partnership. Studies show that 78% of employees who feel empowered by their employers are more likely to stay with their organisation for longer (Forbes, 2020). For the same, our school leaders work closely with staff members, offering guidance, constructive feedback, and professional development that fosters trust and encourages growth.",
          "Mentorship and Feedback: School leaders serve as mentors who are invested in the success and growth of their employees. Employees at Caelum know they can rely on leadership for support, whether it's through ongoing professional development or timely feedback that is both constructive and empathetic.",
          "Empowerment: We believe in empowering our teachers and staff to take ownership of their work. When staff feel trusted to make decisions and innovate within their roles, they are more engaged and motivated. Empowered employees are more likely to feel connected to their work and less likely to leave."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 1/7.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 1/7.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "The relationships among Caelum staff members are crucial in creating a positive, collaborative, and supportive work environment. Teachers, administrative staff, and support staff form close-knit teams, sharing ideas and offering each other support in a variety of ways. Data from Gallup (2019) shows that employees who have close friends at work are three times more likely to feel engaged at their workplace, enhancing job satisfaction and performance.",
          "Collaboration: Regular team meetings and workshops encourage knowledge sharing and collaborative problem-solving. We foster an environment where teachers and staff are encouraged to support each other through mentorship, sharing lesson ideas, and offering guidance on educational techniques.",
          "Social Connections: Employees form personal relationships outside the professional sphere, with school events and informal gatherings designed to foster connections and reduce stress. This sense of camaraderie is what builds the 'family feel' of Caelum."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 1/8.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 1/8.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "A study by the Journal of Educational Psychology (2020) found that schools with strong teacher-student relationships see a 15% increase in academic achievement and a 20% rise in student well-being. Perhaps the most important relationship in any school is the one between staff and students. At Caelum, teachers are more than instructors—they are mentors, guides, and trusted adults who help shape students' emotional and academic growth.",
          "Empathy-Driven Interactions: Teachers engage with students through a child-centred, play-based approach. This fosters trust and emotional connection, ensuring that students feel safe, heard, and encouraged to express themselves.",
          "Positive Role Models: Teachers model emotional intelligence, collaboration, and empathy in their everyday interactions. These values ripple into the classroom environment, influencing how students relate to one another and their broader community."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 1/9.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 1/9.jpg",
    "description": ""
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 1/10.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 1/10.jpg",
    "description": "Employee relations at Caelum go beyond the professional; they form the fabric of our school culture. The interactions between employer and employee, colleagues, other staff, and students create a community where trust, respect, and empathy lead the way. These relationships are not only integral to the functioning of the school but also reflect our core mission: to create a harmonious environment where every individual feels valued, supported, and connected. By nurturing these relationships, we ensure that the Caelum community remains a place where growth and collaboration are at the heart of everything we do and the 'Caelum Way' philosophy is always cherished."
  }
]
