[
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 4/1.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 4/1.jpg",
    "description": "Transcript: To build a high-performing educational environment, Caelum Way schools must employ strategic staffing approaches that not only attract but also develop and retain top talent. Research has shown that well-implemented staffing strategies lead to improved teacher satisfaction, better student outcomes, and lower staff turnover rates (Teaching and Learning International Survey, 2021). This section explores various recruitment, development, and retention strategies that are aligned with Caelum's values of sustainability, holistic employee care, and academic excellence.."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 4/2.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 4/2.jpg",
    "description": "Recruiting the right candidates is the foundation of a strong educational team. The recruitment strategies at Caelum focus on targeting individuals who not only meet specific qualifications but also align with the school’s core philosophy of child-centred, emotionally supportive educatione."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 4/3.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 4/3.jpg",
    "description": "By identifying the precise skills, qualifications, and values needed for each role, Caelum can streamline its hiring process and attract candidates who are not just academically qualified but are passionate about holistic education. Recent studies from Harvard’s Graduate School of Education indicate that schools using targeted recruitment see a 20% increase in new hire retention after the first year. In Finland, one of the top educational systems globally, teacher recruitment focuses on pedagogical skills and emotional intelligence, ensuring that recruits are prepared for both academic and social-emotional teaching demands."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 4/4.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 4/4.jpg",
    "description": "Leveraging the internal network of current employees can be a powerful way to find candidates who fit the school culture. Studies have shown that referral hires have a 15% higher retention rate after two years compared to traditional hires (Glassdoor Economic Research, 2020). Caelum encourages current staff to refer qualified candidates, with added incentives for successful placements."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 4/5.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 4/5.jpg",
    "description": " The power of digital platforms cannot be overlooked. Schools that utilise online job boards and social media have access to a wider pool of candidates, ensuring diversity in the hiring process. Studies show that 73% of job seekers are using social media to find jobs (CareerBuilder, 2019). Caelum will focus on using these platforms to reach out to young talent with modern teaching skills."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 4/6.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 4/6.jpg",
    "description": " Building relationships with educational institutions is a proactive way to source highly qualified recent graduates. Networking with universities and colleges ensures a steady pipeline of well-trained candidates who are familiar with the latest teaching methodologies. Research indicates that schools with strong university ties report a 25% increase in successful hires of new graduates (Institute of Education Sciences, 2021). Charter Schools in the U.S. have formed partnerships with local universities, offering internships and job placements, which has proven successful in acquiring young talent."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 4/7.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 4/7.jpg",
    "description": "Investing in staff development is central to Caelum’s commitment to fostering a culture of continuous improvement. Well-trained and continually developed staff members are more likely to remain motivated, engaged, and loyal to the organisation."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 4/8.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 4/8.jpg",
    "description": " Schools that provide regular professional development (PD) sessions for their staff see improvements not only in teaching effectiveness but also in overall job satisfaction. A recent survey found that 85% of teachers believe that PD opportunities directly impact their classroom practices (EdTech Magazine, 2021). At Caelum, staff will have access to ongoing PD workshops, conferences, and certifications that focus on both academic innovation and emotional intelligence."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 4/9.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 4/9.jpg",
    "description": "Mentorship is a proven way to support new staff and guide their professional journey. Research shows that new hires who are paired with a mentor during their first year are 30% more likely to stay with the organisation long-term (National Mentoring Partnership, 2022). Ontario School Districts in Canada have implemented mentorship programs where veteran teachers support newcomers, resulting in higher teacher satisfaction and retention."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 4/10.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 4/10.jpg",
    "description": "Constructive feedback is key to personal and professional growth. At Caelum, performance reviews are designed to be developmental, providing actionable feedback and identifying opportunities for improvement. According to research by The Center for Educational Research, schools with a focus on feedback-oriented performance reviews see a 10% increase in teacher engagement."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 4/11.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 4/11.jpg",
    "description": "Helping staff identify their career goals and aligning those goals with Caelum’s vision ensures mutual growth. Personalised career development plans offer staff the opportunity to advance within the organisation, fostering loyalty and commitment. Schools with clear career progression frameworks see a 40% higher retention rate (Education World, 2020)."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 4/12.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 4/12.jpg",
    "description": "Retaining top talent is just as important as recruiting them. Caelum’s retention strategies are centred around creating a work environment where employees feel valued, supported, and able to maintain a healthy work-life balance."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 4/13.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 4/13.jpg",
    "description": "Offering competitive salaries and benefits is critical in ensuring staff members feel their efforts are adequately rewarded. The Global Education Salary Study (2021) found that competitive pay reduces teacher turnover by up to 17%. At Caelum, we aim to provide salary packages that meet or exceed market standards, with performance-based incentives and inflation-adjusted salary hikes (typically 3-4%)."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 4/14.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 4/14.jpg",
    "description": " A supportive, nurturing work environment leads to better job satisfaction and lower turnover rates. Schools that prioritise positive work cultures report a 30% reduction in staff attrition (McKinsey & Company, 2021). Caelum is committed to maintaining an emotionally supportive, collaborative environment where teachers and staff feel valued and empowered."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 4/15.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 4/15.jpg",
    "description": " Recognizing staff contributions is key to job satisfaction. Schools that implement recognition programs, whether through awards, bonuses, or public acknowledgment, see higher levels of employee engagement. According to Gallup, organisations with high recognition rates experience 14% better staff retention."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 4/16.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 4/16.jpg",
    "description": "Promoting a healthy work-life balance, with policies like flexible work hours, remote working options, and a focus on personal well-being, is essential in retaining staff long-term. A study by The Work Foundation shows that 82% of educators believe that flexibility in working hours significantly contributes to their decision to stay at their current school."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 4/17.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 4/17.jpg",
    "description": ""
  }
]
