[
  {
    "imageDesktop":   "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 2/1.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 2/1.jpg",
    "description": "This quote underscores the critical importance of teacher training, a concept central to the Caelum Way. Schools in top-performing countries like Finland and Singapore have long recognized that rigorous, ongoing professional development is key to improving both teacher efficacy and student outcomes. A well-trained teacher is not only equipped with subject knowledge but also deeply understands the emotional and academic needs of every student. This section outlines the framework for in-service teacher training at Caelum, grounded in real-world research, practical examples, and tailored strategies. Finland, for example, emphasises high-quality teacher education, with all teachers required to hold master's degrees and participate in continuous professional development. This focus on teacher training has contributed to Finland's consistently high performance in international rankings such as the PISA (Programme for International Student Assessment) tests. Our goal is to ensure that every teacher evolves into a facilitator of holistic development, thereby improving student outcomes and cultivating a nurturing learning environment.  "
  },
  {
    "imageDesktop":   "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 2/2.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 2/2.jpg",
    "description": [
      "The Importance of Personalized Needs Assessment",
      {
        "type": "para",
        "items": [
          "The aim of any effective professional development program is a thorough understanding of the training needs of teachers. The Caelum Way stresses the importance of personalised education not only for students but also for educators. By conducting tailored needs assessments, we ensure that the training addresses both the professional development goals of individual teachers and the collective needs of the school.",
          "Research shows that teachers who receive professional development aligned with their personal career goals are 42% more likely to implement new teaching strategies effectively (Darling-Hammond, 2017). Caelum has holistically embraced this philosophy through customised teacher surveys, focus groups, and classroom observations."
        ]
      }
    ]
  },
  {
    "imageDesktop":   "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 2/3.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 2/3.jpg",
    "description": [
      "Aligning Training Content with Caelum's Child-Centric Philosophy",
      {
        "type": "para",
        "items": [
          "Curriculum development for in-service teacher training is deeply rooted in Caelum's overarching philosophy of teaching the child as a whole. Research indicates that teacher training is most effective when it is practical and directly applicable to the classroom (Timperley, 2011). To this end, our training modules are designed to blend theory with hands-on activities.",
          "For instance, workshops on differentiated instruction allow teachers to design lesson plans that accommodate the diverse learning needs of students. This is essential for the Caelum Way, which emphasises inclusive education and recognizes that each student learns at their own pace and style. During these workshops, teachers engage in role-playing exercises where they assume the roles of students with different abilities and needs, which helps them better understand the importance of differentiation."
        ]
      }
    ]
  },
  {
    "imageDesktop":   "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 2/4.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 2/4.jpg",
    "description": [
      "Building Leadership Within the School Community",
      {
        "type": "para",
        "items": [
          "The Caelum Way extends beyond students and teachers to include the development of facilitators, who are integral in delivering effective training. Facilitators in Caelum schools are not just instructors—they are mentors who guide their peers through the intricacies of child-centred teaching. Research from the Learning Policy Institute suggests that peer-led professional development increases teacher engagement and retention of new methods by up to 38% (Darling-Hammond et al., 2017)."
        ]
      }
    ]
  },
  {
    "imageDesktop":   "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 2/5.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 2/5.jpg",
    "description": [
      "The Role of Data in Shaping Teacher Development",
      {
        "type": "para",
        "items": [
          "Evaluation is a critical component of the Caelum in-service training framework. Regular assessment not only measures the success of training programs but also identifies areas for improvement. We employ a data-driven approach, using Key Performance Indicators (KPIs) such as student engagement, teacher satisfaction, and classroom performance to evaluate the effectiveness of training.",
          "A study by the OECD (2019) found that schools with a systematic evaluation framework were 45% more likely to see sustained improvements in teaching quality. In line with this, we conduct pre- and post-training evaluations and use surveys, student feedback, and classroom observations to track the real impact of training on both teachers and students."
        ]
      }
    ]
  },
  {
    "imageDesktop":   "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 2/6.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 2/6.jpg",
    "description": [
      "The Caelum Way: Holistic Development and Emotional Wellbeing",
      {
        "type": "para",
        "items": [
          "Central to the Caelum Way is the belief that children do best in environments where they are understood and supported holistically. This philosophy extends to teacher training, as we recognize that the success of our students is directly tied to the emotional and intellectual growth of our teachers. Research by Child Trends (2020) confirms that teachers who are trained in emotional intelligence techniques report higher levels of job satisfaction and classroom effectiveness.",
          "Our in-service training sessions include modules on emotional intelligence and mindfulness, teaching educators how to cultivate a supportive and empathetic classroom atmosphere. By prioritising the emotional wellbeing of both teachers and students, we ensure that our schools become places of joy, curiosity, and mutual respect.",
          "Caelum is committed to the continuous professional growth of our educators. By integrating personalised training needs assessments, research-backed curriculum development, and peer-led facilitation, we create an environment where teachers are satisfied and, in turn, happily play their part in the holistic development of their students. The Caelum Way is more than just a teaching philosophy. It is a living framework for nurturing the intellectual, emotional, and social wellbeing of every individual in our school community.",
          "Caelum's students find it easy to confide in their teachers, not only about educational challenges but also personal conflicts. The mutual trust between students and teachers fosters mutual respect, creating a more powerful and transformative educational experience for all."
        ]
      }
    ]
  },
  {
    "imageDesktop":   "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 2/7.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 2/7.jpg",
    "description": ""
  }
]
