[
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/section4/1.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/section4/1.jpg",
    "description": ""
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/section4/2.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/section4/2.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Research shows that traditional methods of recruitment, which focus solely on qualifications and experience, often miss the mark when it comes to finding educators who fit within a school’s unique culture (Levashina et al., 2014). That's why at Caelum, we believe in evaluating qualifications to assess values, emotional intelligence, and a candidate’s ability to foster a positive classroom environment.",
          "By thoughtfully planning the interview process and grounding it in both research and The Caelum Way, we ensure that each new hire will contribute to our happy, child-centered environment. Studies show that teachers who exhibit high levels of emotional intelligence and adaptability help create classrooms where children thrive socially, emotionally, and academically (Durlak et al., 2011). That’s why we focus on hiring not just for technical skill, but for empathy, creativity, and a genuine passion for nurturing young minds.",
          "At Caelum, the interview is not just a step in the recruitment process—it’s a vital part of building a culture where happiness, growth, and learning go hand in hand. By preparing thoughtfully, crafting insightful questions, and fostering an open, welcoming atmosphere, we create the space to find educators who will make a lasting impact on our students’ lives."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/section4/3.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/section4/3.jpg",
    "description": [
      "The Interviewer’s Story: Preparing for the Perfect Candidate",
      {
        "type": "para",
        "items": [
          "Suman, a senior teacher at Caelum, sat at her desk with a sense of purpose. She knew that interviewing at Caelum was about more than just ticking off boxes of qualifications. It was about finding the right cultural fit.",
          "Suman structured the interview around three core components, each grounded in best practices for recruitment"
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/section4/4.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/section4/4.jpg",
    "description": "Research shows that emotionally intelligent teachers significantly impact student well-being, leading to better academic outcomes (Jennings & Greenberg, 2009). Suman crafted a question to gauge how candidates have applied emotional intelligence: Can you describe a time when you helped a student navigate a difficult social situation in class?”\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/section4/5.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/section4/5.jpg",
    "description": "Studies suggest that past behaviors are strong predictors of future success (Taylor et al., 2017). Suman knew that by asking candidates to reflect on their past, she could better assess how they would handle challenges at Caelum. She added: “Tell me about a time when you adapted a lesson plan to meet the diverse needs of students.”"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/section4/6.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/section4/6.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Problem-solving is critical in a dynamic classroom environment. To assess candidates' adaptability, Suman created a scenario where a student was struggling despite multiple interventions:",
          "How would you support a student who is falling behind academically despite your efforts? What would your next steps be?"
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/section4/7.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/section4/7.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Anushree, a passionate educator with five years of teaching experience, had been eagerly preparing for her interview. For her, this wasn’t just another teaching job; it was an opportunity to be part of something bigger—an educational philosophy she truly believed in.",
          "On the day of her interview, Anushree walked into Caelum’s serene campus. Right away, she noticed how different the environment felt—calm, welcoming, and full of positive energy. This wasn’t just a school; it was a community. As she sat down for her interview with Suman, the tone felt conversational, not rigid or intimidating, making Anushree feel valued as a candidate.",
          "Suman broke the ice by asking her about herself and also complimenting her qualifications. ",
          "She then tapped into Anushree’s motivations:",
          "What excites you about working with young children?",
          "Anushree’s face lit up as she shared a story about helping a shy student blossom into a confident learner through creative play. She explained how she used art and music to create an inclusive atmosphere, where every student felt valued and supported.",
          "Suman listened carefully, noting how Anushree’s philosophy aligned with Caelum’s child-centred approach. As they moved on to behavioral and scenario-based questions, Anushree described how she had used hands-on learning to engage students, an approach that mirrored Caelum’s emphasis on inquiry-based and project-based learning."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/section4/8.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/section4/8.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "After Anushree left, Suman met with her colleagues to debrief. They reviewed the interview rubric they had designed, a tool based on a detailed evaluation of both qualifications and cultural fit. Research supports this practice: structured interviews with scoring rubrics have been found to improve hiring success rates by 67% (Levashina et al., 2014).",
          "The team used three key criteria to evaluate Anushree:"
        ]
      },
      {
        "type": "bullet",
        "items": [
          "Alignment with Caelum’s Values: Anushree emphasized emotional well-being and inclusive classrooms, aligning well with Caelum’s philosophy.",
          "Classroom Management: Her examples of handling diverse learners and using creative methods showed she could maintain an adaptable, supportive classroom.",
          "Problem-Solving: Anushree demonstrated adaptability, crucial in a dynamic school environment like Caelum, where every child’s needs are different."
        ]
      },
      "As they discussed her responses, the team agreed: Anushree was exactly the type of teacher who would thrive at Caelum."
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/section4/8.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/section4/8.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "The interview process at Caelum goes beyond qualifications—it's about finding educators who share Caelum's vision of joyful, child-centered education. By crafting thoughtful questions, creating a welcoming environment, and evaluating cultural fit, Caelum ensures that every team member contributes to a thriving, inclusive learning community.",
          "At Caelum, interviews aren't just about hiring teachers—they're about building a culture where happiness, growth, and learning go hand in hand. Through a research-backed, emotionally intelligent approach to recruitment, we find teachers who shape not only students' minds but also their hearts."
        ]
      }
    ]
  }
]
