[
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 5/1.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 5/1.jpg",
    "description": "In the bustling city of Pune, India, Caelum High School is more than just a place of learning; it’s a haven for students and parents seeking a transformative educational experience. For many families, the school emerged as a beacon of hope and change. Having witnessed firsthand the challenges their child faced in a previous school, they were determined to find an institution that would prioritise consistency, quality, and holistic development."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 5/2.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 5/2.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "When their child attended another school, the family encountered significant issues related to curriculum alignment and teaching quality. As they moved from primary to secondary education, the lack of continuity in learning created gaps in knowledge, particularly in critical subjects like Mathematics and Science. This inconsistency left their child feeling unprepared and anxious about the future, echoing the findings of a study by Education Next, which revealed that nearly 40% of U.S. schools grapple with similar problems. The concern grew as they realised that these challenges could hinder their child's potential.",
          "Determined not to repeat this experience, the parent sought a school that could provide a seamless educational journey. Enter Caelum High School, a private institution dedicated to nurturing each student's potential while maintaining rigorous academic standards."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 5/3.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 5/3.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Recognizing the urgent need for a solution, Caelum High implemented a vertical departmentalization model. This innovative approach allows teachers to specialise in a single subject and teach that subject across multiple grade levels, ensuring subject-specific expertise and consistent educational quality.",
          "Research supports the efficacy of this model. A report from the Organisation for Economic Co-operation and Development (OECD) found that schools adopting subject-specialised structures achieved better student outcomes. Inspired by this evidence, Caelum High focused on its Mathematics and Science departments, assigning dedicated subject specialists to work with students from primary through secondary levels."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 5/4.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 5/4.jpg",
    "description": [
      "Specialisation: Teachers became experts in their subjects, enhancing their depth of knowledge and ability to engage students effectively.",
      {
        "type": "para",
        "items": [
          "Curriculum Alignment: A cohesive curriculum was established, allowing students to experience a seamless progression in their learning.",
          "Teacher Collaboration: Subject teachers collaborated to share best practices and maintain instructional consistency across grade levels."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 5/5.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 5/5.jpg",
    "description": [
      "The results were transformative. Within two years of adopting this model, Caelum High saw remarkable improvements:",
      {
        "type": "para",
        "items": [
          "Improved Curriculum Consistency: Students experienced a smoother transition between grades, reflected in a 12% increase in test scores in Mathematics and a noticeable reduction in the need for remedial support.",
          "Enhanced Teacher Expertise: With a focus on specialisation, teachers reported a 25% increase in instructional effectiveness, leading to greater job satisfaction. Over 80% of teachers expressed feeling more fulfilled in their roles.",
          "Reduced Reliance on External Resources: The expertise developed within the faculty resulted in a 30% decrease in parents seeking external tutoring, allowing families to invest more time and resources into other aspects of their children’s education.",
          "Increased Collaboration Among Teachers: Internal surveys indicated a 20% increase in teacher collaboration, fostering a strong community of educators dedicated to student success.",
          "Cost-Effective Solutions: With improved teacher retention and reduced external tutoring needs, the school saved significant costs, contributing to a more sustainable operational model.",
          "Enhanced Student Outcomes: Ultimately, the changes led to an 18% increase in students scoring above 80% in Mathematics and Science, reinforcing the effectiveness of the vertical departmentalization model."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 5/6.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 5/6.jpg",
    "description": "For the parents who once worried about their child’s educational journey, Caelum High School emerged as a revolutionary choice. The school not only addressed the concerns of curriculum gaps and teaching quality but also fostered an environment where students could flourish academically and personally. By embracing vertical departmentalization, Caelum High has positioned itself as a leader in educational innovation, providing students and families with a pathway to success that is grounded in consistency, collaboration, and excellence. This story of transformation serves as an inspiration to other schools and families navigating similar challenges, showcasing the power of thoughtful educational reform."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 5/7.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 5/7.jpg",
    "description": ""
  }
]
