[
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 2//1.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 2/1.jpg",
    "description": ""
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 2//2.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 2/2.jpg",
    "description": "We visualize a Caelum Way school to be an institution where the strength lies in the synergy between its team members, each performing a role that contributes to a vibrant and holistic learning environment. Defining clear staffing roles and responsibilities ensures not just operational efficiency but a culture where every staff member knows their value, how they contribute to the school’s mission, and how they can foster the well-being and growth of every student."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 2//3.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 2/3.jpg",
    "description": " Core Roles in Caelum WayEach staff member in a Caelum school plays a vital role in ensuring the overall success of the students and the smooth functioning of the institution:PrincipalTeachersTeaching Assistants (TAs)AdministratorsSupport StaffSchools with effective collaboration among these roles see improved academic performance and stronger staff satisfaction."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 2//4.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 2/4.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Principals are not just the strategic leader but also the moral compass of the school. According to research by the University of Minnesota, schools with principals who actively engage in both instructional leadership and staff mentoring see a 20% increase in student academic success. Beyond operations, a principal shapes the school’s culture, ensuring every decision aligns with Caelum's philosophy of holistic education, inclusivity, and child-centric values. Their responsibility is not just administrative but profoundly transformational—leading by example, supporting innovation, and fostering a community spirit.",
          "In a 2018 study of Finnish schools, renowned for their innovative approaches to education, it was found that principals who emphasized teacher mentorship and professional development were able to raise student performance on the PISA (Programme for International Student Assessment) by 15% over five years. This approach mirrors Caelum's commitment to leadership that actively nurtures growth among staff and students alike.",
          "Visionary Leadership: The Principal steers the school’s vision, ensuring that it aligns with the evolving needs of students, staff, and the community. Research shows that a principal’s leadership can account for up to 25% of a school’s total impact on student achievement (University of Toronto).",
          "Compliance and Standards: Ensuring that the school meets regulatory requirements is a key part of the principal’s role. This includes adhering to local education boards, maintaining accreditation, and complying with Caelum Way principles.",
          "Professional Development: Principals at Caelum are also leaders in professional development, offering teachers mentorship and career progression opportunities. Research suggests that schools investing in leadership-led professional development see a 15% increase in staff retention (Education Development Trust)."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 2//5.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 2/5.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "At the heart of any school are its teachers. They are the primary drivers of student success, and their roles are far beyond delivering lessons. A 2019 report by the OECD Teaching and Learning International Survey (TALIS) noted that teachers who employed personalised learning strategies saw an average 18% improvement in student engagement. In a Caelum school, teachers aren’t just educators—they are mentors who encourage curiosity, foster creativity, and build emotional intelligence in every student. In classrooms where teachers used inquiry-based and problem-solving approaches, engagement rates increased by 25% (OECD, 2019). ",
          "Personalised Instruction: Teachers are tasked with designing and implementing lesson plans that engage students in both critical thinking and emotional growth. According to a RAND Corporation study, classrooms where teachers employed differentiated instruction saw 20% better academic outcomes.",
          "Collaboration: At Caelum, collaboration is key. Teachers work alongside teaching assistants and administrators to create a cohesive learning experience, resulting in a 30% increase in student support effectiveness (Teaching and Learning International Survey, OECD)."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 2//6.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 2/6.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "In a Caelum Way classroom, teaching assistants play an indispensable role, especially in providing personalised support to students who may require additional help, whether due to learning differences or other challenges. Research by The Sutton Trust highlights that when TAs are integrated into classroom teaching, student performance improves by as much as 10%. Teaching assistants help manage group learning, facilitate projects, and offer students the focused attention they need to succeed, which is especially important in early childhood and special education settings.",
          "In a UK study conducted by The Education Endowment Foundation, schools that deployed teaching assistants in structured, small-group settings saw reading levels among primary students rise by 8% in just one academic year, emphasising the importance of TAs in the educational process.",
          "Small Group Facilitation: TAs support the delivery of lessons, often working one-on-one or with small groups. Their presence allows teachers to focus on more complex instruction, while students benefit from additional assistance.",
          "Inclusive Support: TAs are trained to work with diverse learners, including those with special needs, ensuring that every student has access to tailored education. Research from The National Autistic Society found that schools with trained TAs saw a 25% increase in success rates for special education students."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 2//7.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 2/7.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Behind every great school is a team of efficient administrators who manage the day-to-day operations, allowing educators to focus on teaching. Administrators are responsible for everything from admissions and enrollment to payroll and scheduling. Their contribution is vital to the seamless operation of the school. Data from the National Center for Education Statistics (NCES) shows that schools with streamlined administrative processes experience 15% greater teacher satisfaction and retention, reducing turnover and ensuring continuity.",
          "Schools with well-established administrative protocols, such as Denmark's Odense School, which uses technology to automate admissions and scheduling, have reported a 20% increase in operational efficiency, resulting in more time and resources dedicated to educational outcomes.",
          "Operational Efficiency: Administrators ensure the smooth functioning of the school by managing resources, handling budgets, and maintaining an accurate records system. Schools that streamlined their operations through administrative efficiency saved 15% on overhead costs, reallocating these funds to educational programs (Harvard Education Review)."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 2//8.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 2/8.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "The unseen champions of every school, support staff—whether in counselling, maintenance, or other services—play a critical role in maintaining a healthy, happy, and well-functioning environment. According to research by The American School Counselor Association, access to counselling services boosts student well-being and academic performance by 12%, while schools with dedicated maintenance staff report a 20% improvement in overall health and safety standards. Schools with well-maintained facilities and adequate support staff experience up to a 30% reduction in absenteeism (NCES, 2021).",
          "Well-being Services: Support staff, including counsellors and psychologists, are key to fostering a nurturing school environment. A well-being program can increase student retention by up to 20%, showing that emotional support is just as important as academic support (Journal of School Psychology)."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 2//9.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 2/9.jpg",
    "description": "Defining roles and responsibilities in a Caelum Way school is more than just outlining tasks—it is about creating a cohesive community where everyone knows their place in supporting student success. With well-defined roles backed by data, real-world examples, and research, Caelum continues to build a model of educational excellence that is built on on collaboration, continuous improvement, and an unwavering commitment to holistic student development"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/staffingStructure/16_9/section 2//10.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/staffingStructure/3_4/section 2/10.jpg",
    "description": ""
  }
]
