[
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 3/1.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 3/1.jpg",
    "description": ""
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 3/2.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 3/2.jpg",
    "description": [
      "Mentorship Guidelines:",
      "The goal of the mentorship program in the Caelum Way is to facilitate ongoing professional growth through structured relationships between mentors and mentees. The key objectives include sharing best practices, providing emotional and instructional support, and fostering a community that prioritises both teacher well-being and student success.",
      {
        "type": "bullet",
        "items": [
          "Purpose & Goals: To enhance the professional development of teachers, particularly in the implementation of the Caelum Way, focusing on fostering a child-centred, happiness-driven learning environment. Research suggests that structured mentorship increases teacher retention by up to 20% (Ingersoll & Strong, 2011)."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 3/3.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 3/3.jpg",
    "description": ""
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 3/4.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 3/4.jpg",
    "description": "Criteria for Matching: Successful mentorship programs often rely on effective mentor-mentee pairings. According to a Harvard Graduate School of Education study, matches should be based on subject expertise, teaching style, and personal goals. In the Caelum Way, alignment with the school's child-centred philosophy is a priority. Regular Meetings: At least bi-weekly meetings will ensure consistent communication, allowing for goal tracking and adjustments. Data from The New Teacher Center indicates that regular mentor interactions can improve classroom effectiveness by 30%"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 3/5.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 3/5.jpg",
    "description": "To formalise the relationship, a mentorship agreement should be established, clearly outlining expectations for both parties. The agreement will specify the frequency of meetings, confidentiality, and the shared commitment to professional growth."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 3/6.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 3/6.jpg",
    "description": [
      "Activity 2: Coaching Sessions",
      "Coaching builds upon mentorship by focusing on personalised, one-on-one development sessions. A Gates Foundation Study (2013) found that coaching programs led to a 10% improvement in teacher effectiveness over three years.",
      "Coaching Topics:",
      {
        "type": "bullet",
        "items": [
          "Caelum Way Implementation: How well are teachers embedding the core principles of child-centred, happiness-driven learning in their classrooms?",
          "Classroom Management: Establishing a calm, inclusive atmosphere aligned with the emotional well-being approach of the Caelum Way.",
          "Instructional Strategies: Innovative methods to engage students and facilitate deep learning.",
          "Student Engagement: How teachers can ensure that every child feels heard, valued, and excited about learning.",
          "Professional Development Goals: Tailored plans to help teachers advance in areas they wish to improve."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 3/7.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 3/7.jpg",
    "description": [
      " Coaching Techniques:",
      {
        "type": "bullet",
        "items": [
          "Active Listening: Coaches should listen carefully to the teacher's challenges and needs, ensuring they feel supported.",
          "Open-Ended Questions: Encourage reflection by asking thought-provoking questions such as, 'How can we make learning more joyful for students?'",
          "Reflective Questioning: Guide teachers toward self-assessment, helping them identify areas for growth.",
          "Goal Setting: Collaborative goal-setting sessions help teachers articulate professional aims and lay out actionable steps",
          "Constructive Feedback: By providing targeted, actionable feedback, coaches help teachers refine their practice"
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 3/8.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 3/8.jpg",
    "description": [
      "Activity 3: Coaching Observation and Feedback",
      "Real-world examples, such as Ontario's Teacher Learning and Leadership Program (TLLP), demonstrate the value of structured coaching observations. Teachers who received observation-based coaching reported a 15% increase in their confidence and classroom management skills (TLLP Report, 2017).",
      "Observation Form:",
      "Coaches will use a standardised form during classroom observations to assess the implementation of Caelum Way principles. Categories include:",
      {
        "type": "bullet",
        "items": [
          "Effective integration of student engagement strategies",
          "Classroom culture and management",
          "Instructional methods",
          "Teacher-student rapport"
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 3/9.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 3/9.jpg",
    "description": [
      "Activity 4: Evaluation and Reflection",
      "Research from the National Center for Education Statistics (NCES) shows that regular program evaluations contribute to better teacher performance, with 75% of teachers reporting that feedback helped them refine their practice.",
      "Evaluation Form:",
      "At the end of the mentorship or coaching cycle, both mentors and mentees will provide feedback on the program. Questions may include:",
      {
        "type": "bullet",
        "items": [
          "How did the mentorship program impact your teaching?",
          "What areas of support were most beneficial?",
          "How can the mentorship experience be improved?"
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 3/10.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 3/10.jpg",
    "description": "Feedback is crucial for continuous improvement. According to Learning Forward's 2020 Report, professional development programs that incorporate reflective feedback tend to see higher engagement and longer-term benefits. Finland's education system, known for its child-centred focus, attributes much of its success to strong teacher mentoring programs. In Finland, mentorship is mandatory for new teachers, ensuring they are guided in everything from classroom management to student well-being. Research shows that Finnish schools with structured mentoring programs report 20% higher job satisfaction among new teachers (Finnish National Agency for Education, 2019)."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 3/11.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 3/11.jpg",
    "description": "By implementing a well-structured mentorship and coaching framework, the Caelum Way ensures that teachers are not only supported but also empowered to grow in their roles. The child-centred philosophy of Caelum High emphasises both academic and emotional growth, ensuring teachers are equipped with the tools they need to foster a positive, happy, and effective learning environment. Drawing on the best practices from global education systems, the mentorship and coaching model at Caelum is positioned to bring long-term benefits to both teachers and students alike. Caelum has pledged to the continuous professional growth of our educators. The structure begins with senior mentors who are responsible for reaching out to their peers, ensuring that the mentoring process is seamlessly passed down to the primary teachers. This system encourages a strong mentorship culture, with regular meetings between teams to share experiences, discuss challenges, and collaboratively address issues. By integrating personalised training needs assessments, research-backed curriculum development, and peer-led facilitation, we create a space where teachers are satisfied and, in turn, happily play their part in the holistic development of their students."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 3/12.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 3/12.jpg",
    "description": ""
  }
]
