[
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section1/1.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section1/1.jpg",
    "description": ""
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section1/2.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section1/2.jpg",
    "description": [
      "Happiness is not something ready-made. It comes from your own actions.",
      "— Dalai Lama",
      {
        "type": "para",
        "items": [
          "This couldn’t be truer in the world of education. Caelum lays its foundation on the belief that a truly great school should be a happy space for students, teachers, and the community. We call this “The Caelum Way,” and it’s more than just an approach to education; it’s a mindset that makes everyone associated with it want to show up because they know that this is the place where they will grow and thrive.",
          "These statistics are not just numbers; they are the bedrock of our philosophy at Caelum. When teachers are happy, students feel safe, supported, and motivated to explore their potential."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section1/3.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section1/3.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "The energy in a classroom is contagious. When teachers come in feeling fulfilled and excited, that energy ripples through the room. Think back to the teachers who left a mark on your life. They weren’t just good at teaching facts or following lesson plans—they made learning feel personal and meaningful. They connected with their students on a deeper level, creating a space where everyone felt valued, where curiosity was nurtured, and where learning was a shared adventure.",
          "At Caelum, teaching is more than just a profession; it’s a passion. We look for educators who don’t merely deliver lessons but also ignite curiosity and foster character development. Research reveals that students excel academically when they feel supported by empathetic and emotionally intelligent teachers."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section1/4.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section1/4.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "The Caelum Way is grounded in a simple yet powerful philosophy: happy teachers lead to happy students. When our educators thrive, they create an environment rich in continuous growth and shared joy. While we celebrate academic achievements, our focus goes beyond mere metrics. We prioritise creating a nurturing atmosphere where happiness is woven into every lesson, making learning feel less like work and more like a delightful journey of discovery.",
          "At Caelum, we believe that teachers are lifelong learners dedicated to their own growth as much as their students’. They are the heart of our vibrant community, bringing out the best in every child by being at their best. In a world that often feels disconnected, Caelum stands out as a refreshing space where happiness and learning intertwine. Here, every day is an opportunity to be kinder, more curious, and engaged, reinforcing that happiness is the key to unlocking potential in both teachers and students."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section1/5.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section1/5.jpg",
    "description": ""
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section1/6.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section1/6.jpg",
    "description": [
      "Soft Skills – The Foundation of Strong Educators",

      {
        "type": "bullet",
        "items": [
          "Communication Skills: Our teachers are the ultimate conversation starters! They masterfully connect with students, parents, and colleagues, creating an environment where ideas flow, and everyone feels heard and valued. They turn discussions into exciting dialogues that spark curiosity!",
          "Problem-Solving Skills: Every day in the classroom is an adventure, and our educators are the creative wizards who navigate challenges with flair! Whether it’s reimagining a lesson or resolving a little hiccup, they think outside the box, ensuring learning never misses a beat.",
          "Flexibility and Adaptability: In the world of education, no two days are the same, and our teachers thrive on that! They roll with the punches, adjusting their plans and strategies to meet the unique needs of their students. Their adaptability keeps the classroom dynamic and engaging.",
          "Positive Attitude: With a sunny disposition and a growth mindset, our educators see challenges as stepping stones to success. They inspire their students to embrace the learning journey with enthusiasm, turning every stumble into a dance move on the path to discovery.",
          "Professionalism: Our teachers set the gold standard! With a commitment to integrity and ethics, they lead by example, inspiring both students and colleagues. They are always on the lookout for opportunities to grow and refine their skills, showing that learning never stops."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section1/7.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section1/7.jpg",
    "description": [
      {
        "type": "bullet",
        "items": [
          "Educational Background: Knowledge is power, and our teachers are well-equipped! A bachelor’s degree in education or a related field is a must. Our educators are lifelong learners, always excited to expand their expertise and bring fresh ideas to the table",
          "Teaching Experience: Experience is like a treasure chest, and we value every unique gem within it! Whether from traditional classrooms or alternative settings, each educator brings a wealth of experience that enriches our community and benefits our students.",
          "Pedagogical Knowledge: Our teachers are teaching superheroes, armed with effective methodologies that cater to every learning style! They incorporate inquiry-based and project-based learning, transforming lessons into thrilling quests for knowledge.",
          "Subject Matter Expertise: Passion is contagious, and our teachers spread it like confetti! They not only master their subjects but also infuse every lesson with excitement, making learning adventure students can’t resist joining.",
          "Understanding of Child Development: Our educators are child development aficionados! They know the ins and outs of cognitive, emotional, and social growth, allowing them to support every child’s unique journey. They create safe spaces where children flourish and explore."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section1/8.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section1/8.jpg",
    "description": [
      "Soft Skills – The Foundation of Strong Educators",
      {
        "type": "bullet",
        "items": [
          "Shared Vision: Join us on an incredible adventure where every teacher aligns with our child-first philosophy! Our educators spark curiosity and nurture a love of learning that lasts a lifetime, guiding students on their quests for knowledge.",
          "Embracing Technology: Our teachers are digital pioneers! In today's tech-savvy world, they leverage innovative tools to create interactive and engaging lessons, preparing students to thrive in the future while having a blast in the process.",
          "Fostering a Growth Mindset: At Caelum, we celebrate the journey of learning! Our educators encourage students to embrace challenges and view mistakes as opportunities for growth. They turn setbacks into stepping stones, building resilience along the way.",
          "Promoting Inclusivity: Inclusivity is at the heart of our community! Our classrooms are welcoming spaces where every student feels seen, heard, and supported. Our teachers create an environment that celebrates diversity, making sure everyone can shine.",
          "Collaborative Spirit: Teamwork makes the dream work! Our teachers thrive on collaboration, sharing ideas and learning from one another to enhance student experiences. They know that together, they can achieve great things!"
        ]
      }
    ]
  }
]
