[
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 2/1.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 2/1.jpg",
    "description": "Competitive compensation and benefits should be more than just a strategy for attracting and retaining talent. They should be a powerful expression of how much people are valued. Rooted in sustainability, meritocracy, and care for overall well-being, ‘Caelum Way’ approach goes above and beyond mere compliance with Indian labour laws and ICSE standards. We prioritise both teacher satisfaction and long-term sustainability. Our compensation model is inspired by research-backed practices that elevate employee loyalty, satisfaction, and performance while remaining responsive to local and national standards."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 2/2.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 2/2.jpg",
    "description": "Every position at Caelum is carefully evaluated to ensure fairness and equity in our compensation structure. We assess roles based on their responsibilities and contributions, creating a system that rewards people for the complexity and impact of their work. Schools that conduct regular job evaluations report up to 15% higher employee satisfaction due to the perception of pay fairness (Mercer, 2020). For the same, we aim at regularly assessing the demands, responsibilities, and skills required for each role, we ensure that our pay structure remains equitable and aligned with both industry standards and Caelum’s unique educational approach. Studies show that companies implementing structured job evaluations reduce pay discrepancies and improve transparency by up to 30% (WorldatWork, 2021).\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 2/3.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 2/3.jpg",
    "description": "We maintain a dynamic salary band system, updated annually to reflect market rates and inflation. A recent Mercer study found that educational institutions offering well-defined salary bands saw 20% higher employee satisfaction rates than those without (Mercer, 2022). To set our bands, we leverage data from local educational institutions, enabling us to offer competitive pay that is sustainable and reflective of our educators' essential contributions. These bands, informed by market rates and internal evaluations, ensure that everyone knows where they stand and how they can progress.\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 2/4.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 2/4.jpg",
    "description": "Merit-based compensation models result in a 23% increase in employee engagement, with a corresponding 32% boost in productivity (Deloitte, 2022). By linking increments to inflation, Caelum builds financial security for teachers, who otherwise might experience pay stagnation. Data from the Reserve Bank of India indicates that inflation-adjusted wages are crucial to sustainable purchasing power and overall job satisfaction. Our inflation-adjusted salary strategy aims to address these realities, reducing attrition and supporting career longevity at Caelum. Regular salary reviews not only ensure that employees are compensated fairly but also support an ongoing commitment to performance recognition."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 2/5.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 2/5.jpg",
    "description": "Research from the Society for Human Resource Management (SHRM, 2022) emphasises that organisations providing holistic benefits see a 50% reduction in turnover. We understand that a truly competitive benefits package goes beyond fulfilling legal requirements. Our benefits are designed to reflect the care we have for our employees’ health, financial security, and personal growth, fostering a balanced and fulfilling work-life experience.\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 2/6.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 2/6.jpg",
    "description": "Comprehensive health insurance for employees and dependents at Caelum includes medical, dental, and mental health support, helping to reduce stress and improve productivity. According to India’s National Family Health Survey (NFHS-5), accessible healthcare benefits are directly linked to higher employee retention. In response, our program extends beyond basic requirements, aiming for complete well-being."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 2/7.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 2/7.jpg",
    "description": "We are committed to helping employees plan for their future. In accordance with Indian law, Caelum provides contributions to the Employee Provident Fund (EPF) and gratuity benefits. The EPF is a government-mandated savings scheme where both the employee and employer contribute a percentage of the employee’s salary, building a retirement corpus. Gratuity, another statutory benefit, is paid out to employees who have completed five years of service, providing additional financial security upon retirement or resignation.\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 2/8.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 2/8.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Our generous leave policies, which include annual, sick, and maternity/paternity leave, not only exceed the minimum legal requirements but also support a balanced, family-friendly workplace. In a 2023 survey by Glassdoor, schools with strong PTO policies saw up to a 60% boost in employee morale. Caelum provides flexible leave policies allowing teachers to recharge, preventing burnout and contributing to higher job satisfaction.",
          "‘Well-Rested, Well-Performing’- we believe that taking time off leads to better performance at work. Our team comes back recharged and motivated, which benefits both them and our students."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 2/9.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 2/9.jpg",
    "description": "Caelum also extends benefits like transportation allowances, meal vouchers, and employee discounts—elements that add value to our educators' day-to-day experiences. These benefits, though not legally required, reflect our belief in holistic employee support and have been shown to positively impact work-life balance (SHRM, 2022)."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 2/10.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 2/10.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Exceeding Minimum Wage Standards: Compliance with minimum wage laws is foundational to our compensation strategy. By setting fair, competitive wages, we promote equity and trust within our team. Reports by India’s Ministry of Labour and Employment show that wage compliance improves employee satisfaction by 20%, an insight we take seriously at Caelum.",
          "Provident Fund Contributions: In alignment with the Employees’ Provident Fund (EPF) Act, Caelum’s retirement contributions demonstrate our commitment to securing the financial well-being of our employees. Schools across India that implement strong provident fund practices have observed a notable increase in retention and staff satisfaction (EPFO, 2022).",
          "Professional Tax Compliance: Doing the Right Thing: We ensure that all statutory obligations, including professional tax collection and remittance, are strictly adhered to. This reflects our commitment to being a responsible employer."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 2/11.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 2/11.jpg",
    "description": [
      "Caelum started with the passion of building a sustainable education system—where generosity and realism go hand in hand. Instead of sporadic, grand gestures, we focus on consistent improvements that foster loyalty, engagement, and long-term satisfaction.",
      {
        "type": "para",
        "items": [
          "Merit-Oriented and Sustainable: Our compensation philosophy is merit-driven. We reward performance, growth, and dedication, ensuring that both individual and organisational success are in sync. This sustainable approach means that as Caelum grows, so too do the opportunities and rewards for our employees.",
          "Consistency Over Flashy Gestures: We believe in steady, meaningful improvements to compensation and benefits rather than one-off rewards that fade quickly. Our goal is to create a lasting environment where employees feel valued every day, not just at review time.",
          "Generosity Grounded in Realism: By balancing generosity with realism, we offer a compensation package that is not just competitive but sustainable—ensuring our employees are rewarded fairly."
        ]
      },
      "Our compensation and benefits structure is designed to be transparent, sustainable, and rewarding. We offer more than just a paycheck—we offer an opportunity to be part of a community that cares about its people and helps them grow. This is the Caelum Way, where both staff and students work and grow together."
    ]
  }
]
