[
  {
    "imageDesktop": "/assets/learning_resource_data/leadership/communityEngagement/Section2/16_9/1.jpg",
    "imageMobile": "/assets/learning_resource_data/leadership/communityEngagement/Section2/3_4/1.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Engaging with parents is essential for fostering a supportive educational environment and helping students thrive. Positive, open relationships between a school and parents can lead to greater student success, stronger community ties, and a more collaborative atmosphere. Schools that proactively involve parents in their child's educational journey benefit from increased trust, shared goals, and a unified approach to supporting students",
          "In this section, we'll explore effective strategies for connecting with parents and offer a Parent Engagement Survey template to help assess the quality of these relationships. By using this template and other engagement methods, schools can build a partnership with parents that benefits students, strengthens communication, and reinforces the school's commitment to holistic development."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/leadership/communityEngagement/Section2/16_9/2.jpg",
    "imageMobile": "/assets/learning_resource_data/leadership/communityEngagement/Section2/3_4/2.jpg",
    "description": ""
  },
  {
    "imageDesktop": "/assets/learning_resource_data/leadership/communityEngagement/Section2/16_9/3.jpg",
    "imageMobile": "/assets/learning_resource_data/leadership/communityEngagement/Section2/3_4/3.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Consistent, transparent communication is at the heart of strong parent engagement. Schools should strive to provide multiple channels for updates and important information, ensuring that all parents feel well-informed and connected.",
          "Examples of communication channels include newsletters, email updates, social media posts, and in-person or virtual meetings. Schools may also consider hosting webinars or Q&A sessions where parents can discuss their concerns directly with teachers or school administrators."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/leadership/communityEngagement/Section2/16_9/4.jpg",
    "imageMobile": "/assets/learning_resource_data/leadership/communityEngagement/Section2/3_4/4.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "A welcoming environment makes parents feel valued and comfortable reaching out to staff. Schools can create these spaces by holding regular open houses, offering school tours, and creating parent lounges or common areas for meetings.",
          "Additionally, staff training in friendly communication and cultural sensitivity can help parents feel respected and part of the school community."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/leadership/communityEngagement/Section2/16_9/5.jpg",
    "imageMobile": "/assets/learning_resource_data/leadership/communityEngagement/Section2/3_4/5.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Gathering feedback from parents is an effective way to understand their needs, address their concerns, and improve the school environment. Conducting a Parent Engagement Survey is an excellent starting point for this.",
          "Surveys allow parents to share honest views, giving schools insights into areas where they're excelling or may need improvement. The feedback can also guide schools in adapting communication practices and addressing parent concerns more proactively."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/leadership/communityEngagement/Section2/16_9/6.jpg",
    "imageMobile": "/assets/learning_resource_data/leadership/communityEngagement/Section2/3_4/6.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Schools can actively involve parents by inviting them to participate in school activities, such as volunteering, attending parent workshops, or joining advisory committees.",
          "By providing parents with these engagement opportunities, schools not only strengthen community bonds but also enable parents to witness their child's development firsthand, building a sense of shared purpose."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/leadership/communityEngagement/Section2/16_9/7.jpg",
    "imageMobile": "/assets/learning_resource_data/leadership/communityEngagement/Section2/3_4/7.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Recognising student achievements and community contributions publicly helps parents feel included and proud of their school community. Celebrating these successes—through school assemblies, newsletters, or social media—reinforces a positive school culture.",
          "Parents who feel that their contributions are appreciated are more likely to remain engaged and advocate for the school within the wider community."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/leadership/communityEngagement/Section2/16_9/8.jpg",
    "imageMobile": "/assets/learning_resource_data/leadership/communityEngagement/Section2/3_4/8.jpg",
    "description": ""
  },
  {
    "imageDesktop": "/assets/learning_resource_data/leadership/communityEngagement/Section2/16_9/9.jpg",
    "imageMobile": "/assets/learning_resource_data/leadership/communityEngagement/Section2/3_4/9.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Once the survey is completed, schools should review responses to identify trends, common concerns, and specific feedback points. By categorizing responses into themes such as communication, involvement, and accessibility, schools can more easily pinpoint areas that may need improvement.",
          "For instance, if multiple parents mention difficulties in contacting staff, the school might consider increasing administrative support or providing direct communication channels between parents and teachers. Alternatively, if parents express interest in more community events, the school can develop additional opportunities for involvement.",
          "Survey results should be shared with staff and, where appropriate, with the wider school community. This transparency helps parents feel that their input is valued, reinforcing their trust in the school."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/leadership/communityEngagement/Section2/16_9/10.jpg",
    "imageMobile": "/assets/learning_resource_data/leadership/communityEngagement/Section2/3_4/10.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Building meaningful relationships with parents requires a proactive approach and an openness to feedback. By focusing on open communication, involving parents in school activities, and regularly collecting their feedback, schools can cultivate a supportive partnership that benefits students' academic and social development.",
          "The Parent Engagement Survey offers a practical tool for gathering insights into parents' needs and expectations. Schools that respond thoughtfully to this feedback strengthen their connection with parents, creating a collaborative environment that ultimately fosters student success and a positive school culture."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/leadership/communityEngagement/Section2/16_9/11.jpg",
    "imageMobile": "/assets/learning_resource_data/leadership/communityEngagement/Section2/3_4/11.jpg",
    "description": ""
  },
  {
    "imageDesktop": "/assets/learning_resource_data/leadership/communityEngagement/Section2/16_9/12.jpg",
    "imageMobile": "/assets/learning_resource_data/leadership/communityEngagement/Section2/3_4/12.jpg",
    "description": ""
  }
]
