[
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/section5/1.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/section5/1.jpg",
    "description": ""
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/section5/2.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/section5/2.jpg",
    "description": ""
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/section5/3.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/section5/3.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Research shows that combining structured interview techniques with practical and scenario-based assessments are quite effective. This method is known to increase the predictive validity of recruitment outcomes by up to 67% (Levashina et al., 2014). Thus, we have adopted a system wherein we use a combination of structured assessment tools. This ensures that the community we are trying to build does not consist of just skilled individuals but is a family that deeply resonates with the Caelum Way.",
          "The Caelum Way Recruitment Scorecard is central to our interview process. It offers a structured format for evaluating a candidate’s competencies and alignment with our core values. We have made sure that the scorecard provides a clear framework for assessing not just technical qualifications but also the emotional and psychological traits that are key to thriving in Caelum’s unique environment.",
          "Recruitment at Caelum is more than a process of filling vacancies; it is about ensuring that each new hire contributes meaningfully to our child-centered, emotionally nurturing environment. One key to ensuring this alignment is through the use of robust assessment tools. These tools allow us to evaluate candidates not only on their qualifications and skills but also on their potential fit within the Caelum Way, which values emotional intelligence, creativity, collaboration, and a growth mindset."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/section5/4.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/section5/4.jpg",
    "description": [
      "Standardised assessments are tools that provide an objective evaluation of a candidate’s qualifications and core skills. At Caelum, these assessments include:",
      {
        "type": "bullet",
        "items": [
          "Subject-Matter Tests: These tests assess a candidate’s knowledge and understanding of the specific subject area they will be teaching. A strong foundation in subject matter is essential, as it ensures teachers can confidently guide students through academic content.",
          "Teaching Skills Assessments: These evaluations measure a candidate’s ability to plan and deliver effective lessons, as well as manage classroom dynamics. This includes assessing their use of various teaching methodologies and their ability to adapt lessons to meet diverse learning needs.",
          "Personality Assessments: These tests aim to identify key personality traits, including empathy, resilience, and emotional intelligence. At Caelum, personality assessments play a crucial role in determining whether a candidate shares our values and can contribute to fostering a nurturing, positive environment for students."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/section5/5.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/section5/5.jpg",
    "description": [
      "While standardised tests provide a foundation, customised assessments offer deeper insights into how candidates might perform in real-world scenarios at Caelum. These include:",
      {
        "type": "bullet",
        "items": [
          "Scenario-Based Assessments: Candidates are presented with classroom-based scenarios, such as managing a disruptive student or supporting a child who is struggling emotionally. These assessments help evaluate their problem-solving abilities, adaptability, and decision-making skills.",
          "Example Scenario: How would you support a student who consistently struggles with social interactions in class? What strategies would you use to help them build confidence and foster relationships with their peers?",

          "Role-Playing Exercises: Candidates are asked to simulate real-life teaching situations. This helps us assess their interaction with students, teaching style, and classroom management techniques. Role-playing also provides insight into how they balance empathy and authority in the classroom.",
          "Group Activities: Collaboration is a cornerstone of the Caelum Way. Group activities allow us to observe how candidates work as part of a team, how they contribute to collective problem-solving, and their ability to collaborate with both peers and students."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/section5/6.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/section5/6.jpg",
    "description": [
      "In an increasingly digital world, online assessments offer a flexible and efficient way to pre-screen candidates. Caelum utilises online tools to streamline the recruitment process while ensuring a thorough evaluation of each candidate’s skills and cultural fit.",
      {
        "type": "bullet",
        "items": [
          "Pre-Employment Assessments: These assessments allow us to quickly identify candidates who meet the basic requirements for a teaching position. They may include basic subject knowledge tests, general teaching aptitude tests, and personality assessments.",
          "Skills Assessments: These tests evaluate a candidate’s technical and pedagogical skills. They can include lesson planning, understanding of technology integration in classrooms, and knowledge of teaching methodologies like inquiry-based learning.",
          "Personality Assessments (Online): Just as in face-to-face interviews, we assess candidates’ emotional intelligence, empathy, and alignment with the Caelum philosophy via online platforms. These assessments help to ensure that those who advance in the recruitment process are a good fit for our school's unique culture."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/section5/7.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/section5/7.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Caelum’s recruitment process combines structured evaluations, scenario-based assessments, and a focus on emotional intelligence to ensure that every hire contributes positively to our school culture. These tools, grounded in contemporary research, are integral to fostering an environment where students and teachers alike are happy, inspired, and empowered to grow. Through this holistic approach, we ensure that each teacher embodies the Caelum Way and helps create classrooms where happiness, learning, and emotional well-being thrive together.",
          "Assessing a candidate’s fit for the Caelum Way goes beyond standard qualifications and credentials. By leveraging a combination of assessment tools, we can holistically evaluate candidates for their subject knowledge, teaching methodologies, and, crucially, their cultural fit with Caelum’s philosophy of joyful, child-centred learning.",
          "These tools ensure that every educator who joins our team is not only qualified to teach but is also passionate about nurturing young minds and contributing to the emotional and intellectual growth of each child. Through thoughtful recruitment and assessment, we build a teaching team that embodies the values of the Caelum Way—where happiness, growth, and learning are at the heart of everything we do."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/section5/8.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/section5/8.jpg",
    "description": ""
  }
]
