[
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 4/1.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 4/1.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "The most valuable assets of Caelum are our people. When we invest in our employees, we know that we are investing in the foundation of our school. Moreover, as Mark Twain humorously pointed out, “Training is everything.” Just as the peach evolves from a bitter almond to a sweet fruit, we believe that our employees can flourish through continuous training and development. We aim at providing various professional development opportunities, mentorship programs, and career growth pathways designed to nurture the potential within each educator.",
          "Investing in employee development and training is not just a strategic necessity; it’s a commitment to fostering a high-performing workforce and nurturing a culture of continuous learning. Research indicates that organizations that prioritise employee development can improve overall performance by as much as 24% (Harvard Business Review, 2019). "
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 4/2.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 4/2.jpg",
    "description": "Training Programs: Caelum offers a huge array of training programs tailored to enhance the skills and knowledge of our employees. Research indicates that organisations with comprehensive training programs experience a 24% higher profit margin than those without (Harvard Business Review, 2019). Our workshops, seminars, and conferences not only keep employees informed about the latest educational trends but also ignite their passion for teaching.\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 4/3.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 4/3.jpg",
    "description": "Online Courses:Recognizing the need for flexible learning, Caelum provides access to a wide range of online courses and resources. According to the Association for Talent Development (2018), organisations that offer online learning opportunities experience a 42% increase in employee satisfaction. Our curated digital library features courses on pedagogical best practices, classroom management, and personal development, allowing employees to learn at their own pace while aligning their growth with the Caelum Way.\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 4/4.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 4/4.jpg",
    "description": "Mentorship is a key foundation of Caelum’s employee development strategy. By pairing less experienced educators with seasoned mentors, we create a support system that fosters professional growth and cultural alignment. Studies show that mentorship programs lead to a 15% increase in employee engagement and retention (Educational Leadership Journal, 2020). Our mentors guide new hires through the intricacies of the Caelum philosophy, ensuring they not only adapt to their roles but also contribute meaningfully to our vibrant community.\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 4/5.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 4/5.jpg",
    "description": "To broaden skill sets and enhance adaptability, Caelum implements job rotation programs. This practice allows employees to explore different roles within the organisation, fostering a deeper understanding of the interconnectedness of our educational approach. Research shows that job rotation enhances employee engagement by 15% and encourages a culture of collaboration and creativity (Gallup, 2018). By providing exposure to various functions, we enable our staff to develop a holistic view of our mission, making them more effective in their primary roles.\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 4/6.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 4/6.jpg",
    "description": "To broaden skill sets and enhance adaptability, Caelum implements job rotation programs. This practice allows employees to explore different roles within the organisation, fostering a deeper understanding of the interconnectedness of our educational approach. Research shows that job rotation enhances employee engagement by 15% and encourages a culture of collaboration and creativity (Gallup, 2018). By providing exposure to various functions, we enable our staff to develop a holistic view of our mission, making them more effective in their primary roles.\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 4/7.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 4/7.jpg",
    "description": "At Caelum, we empower our employees to take ownership of their growth through Individual Development Plans (IDPs). Each educator is encouraged to create a personalised plan that aligns with their career aspirations and the values of the Caelum Way. Studies have shown that employees with IDPs are 65% more likely to achieve their career goals (Forbes, 2021). By providing a structured framework, we help our team members navigate their professional journeys with clarity and purpose.\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 4/8.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 4/8.jpg",
    "description": "To support our employees in identifying career paths and developing necessary skills, we offer career counselling services. This initiative is grounded in the belief that career growth should be a collaborative process, facilitated by experienced advisors who understand the unique landscape of our organisation. Research indicates that employees who receive career counselling report a 30% increase in job satisfaction and engagement (Career Development Quarterly, 2019).\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 4/9.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 4/9.jpg",
    "description": "Recognizing the importance of continuity and growth, Caelum actively engages in succession planning. By identifying potential successors for key positions and providing them with targeted development opportunities, we ensure the sustainability of our mission. According to the Society for Human Resource Management (2020), organisations with effective succession plans experience a 12% increase in overall performance. This proactive approach not only secures our leadership pipeline but also reinforces our commitment to employee development.\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 4/10.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 4/10.jpg",
    "description": "Coaching and mentoring are integral components of our on-the-job training initiatives. Research demonstrates that coaching improves employee performance by 70% (International Coaching Federation, 2019). Caelum founders provide ongoing support, helping educators refine their instructional strategies while embracing the Caelum Way. This hands-on guidance fosters a culture of continuous improvement and collaboration."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 4/11.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 4/11.jpg",
    "description": "We believe in the power of experiential learning. By assigning employees to project-based initiatives, we allow them to apply their skills in real-world contexts while developing new competencies. This method not only enhances engagement but also fosters innovation. Studies show that project-based learning increases retention rates by 60% compared to traditional teaching methods (Buck Institute for Education, 2018).\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 4/12.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 4/12.jpg",
    "description": "Caelum offers job shadowing opportunities for employees to observe and learn from experienced colleagues. This practice enables them to gain insights into effective teaching practices and classroom management strategies. According to research, employees who engage in job shadowing report a 50% increase in confidence in their roles (Training Industry Magazine, 2020)."
  }
]
