[
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 4/1.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 4/1.jpg",
    "description": "Professional development is a key fundamental of the Caelum Way. To sustain a high-quality learning environment, it is essential to equip teachers with ongoing learning opportunities that foster growth and enhance their instructional strategies. This section outlines the steps involved in conducting a thorough professional development plan for Caelum teachers, grounded in both global best practices and the unique needs of the school.\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 4/2.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 4/2.jpg",
    "description": [
      "Activity 1: Professional Development Needs Assessment",
      "A key starting point for any professional development initiative is identifying the specific needs of teachers. The Caelum Way requires teachers to have expertise in creating positive, child-focused environments while also integrating emotional well-being into academic instruction.",
      "Survey: ",
      {
        "type": "para",
        "items": [
          "A detailed survey will help assess teachers' current skills, interests, and perceived areas of growth. Questions should focus on topics such as:",
          "Familiarity with Caelum Way principles",
          "Areas of instructional improvement (e.g., student engagement, lesson planning)",
          "Interest in new pedagogical strategies, such as integrating technology in the classroom or exploring emotional learning tools"
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 4/3.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 4/3.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          " Example survey question: 'How confident do you feel in applying the Caelum Way's child-centric approach in your daily instruction?'",
          "Focus Groups:  ",
          "Bringing teachers together for focus groups allows for rich, interactive discussions around professional development needs. It can reveal more nuanced insights into the challenges they face, especially when implementing Caelum's happiness-focused teaching philosophy.",
          "Observations:",
          "Classroom observations provide a direct lens into teaching practices. Observers can look for areas where teachers are succeeding and where more targeted support might be necessary, such as managing large class sizes or integrating individualised attention within a happiness-centred curriculum."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 4/4.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 4/4.jpg",
    "description": [
      "Activity 2: Professional Development Calendar",
      "Once needs are identified, schools can create a structured professional development calendar to ensure teachers have regular, meaningful learning opportunities throughout the year. ",

      {
        "type": "para",
        "items": [
          "Training Formats:",
          "The Caelum Way encourages a mix of training formats to cater to various learning preferences among teachers. Offerings should include:",
          "Workshops: Interactive, hands-on sessions where teachers can practise new strategies, such as techniques for promoting student happiness or engaging children emotionally in learning.",
          "Seminars: Lectures by experts on cutting-edge educational research or the latest teaching techniques.",
          "Online Courses: Allowing flexibility for teachers to complete professional development at their own pace.",
          "Conferences: Opportunities to connect with educators from other child-centred schools and learn from their successes.",
          "Coaching and Mentoring: Personalized, one-on-one or small group development to reinforce key concepts and offer specific, practical advice."
        ]
      },
      "By diversifying professional development formats, schools can accommodate different learning styles and ensure teachers remain engaged and motivated."
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 4/5.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 4/5.jpg",
    "description": [
      "Activity 3: Curriculum Development for Professional Development",
      "Curriculum development for professional development programs must be directly aligned with the Caelum Way's child-centric and emotionally supportive philosophy. Each training session should have clearly outlined objectives, with specific activities aimed at enhancing teachers' abilities to create happy and productive classrooms.",
      {
        "type": "para",
        "items": [
          "Curriculum Development Guide:",
          "Content: Focus on key areas such as emotional intelligence, child-centred classroom management, and strategies to incorporate happiness into curriculum design. For instance, workshops could include lesson planning that fosters emotional growth alongside academic achievement.",
          " Training Methods: Interactive, experiential learning activities like role-playing classroom scenarios where student emotions are at the forefront.",
          "Materials: Handouts, videos, and case studies from successful schools like Finland's education model or Singapore's teacher training programs, which emphasise emotional well-being and student happiness."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 4/6.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 4/6.jpg",
    "description": [
      "Professional development should not be static but rather a process of continuous improvement. Evaluating the effectiveness of these programs ensures that they meet the intended goals and truly support teacher growth.",
      "Evaluation Form:",
      {
        "type": "para",
        "items": [
          "For more concrete evaluation, use pre- and post-tests to measure learning outcomes. For instance, teachers could be asked to demonstrate their understanding of happiness-focused teaching strategies before and after training sessions. This helps in quantifying the impact of the training."
        ]
      },
      "Pre- and Post-Tests:",
      {
        "type": "para",
        "items": [
          "After each training session, gather feedback from participants using evaluation forms. Ask questions like:",
          "How well did this session help you understand the principles of the Caelum Way?",
          "What additional support do you feel you need to implement these strategies in your classroom?"
        ]
      },
      "Data Analysis:  ",
      {
        "type": "para",
        "items": [
          "Analyse both qualitative and quantitative data from the evaluations to determine trends, identify areas for improvement, and refine the professional development calendar accordingly. For example, if feedback indicates a lack of confidence in classroom technology use, future sessions could focus more heavily on that area."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 4/7.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 4/7.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Professional development in the Caelum Way is a dynamic and integral process that prioritises teacher growth, emotional intelligence, and child-centred learning strategies. By conducting thorough needs assessments, offering diverse and engaging training formats, and regularly evaluating their effectiveness, Caelum High School can ensure that its teachers are well-equipped to foster a positive and productive learning environment. The success stories from global leaders like Finland and Singapore further reinforce the importance of investing in teacher development to achieve long-term educational success.",
          "Professional development goes beyond just training. We see it as a career-building process. Teachers have the opportunity to complete their B.Ed while working at the school, enabling them to become fully qualified educators within the system. Caelum is dedicated to upskilling its staff and promoting them within, fostering an environment where growth is nurtured from within. Teachers with the right qualifications and experience in junior classes are also given opportunities for advancement, such as being promoted to coordinator roles, ensuring that they continue to grow both professionally and personally within the Caelum community."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 4/8.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 4/8.jpg",
    "description": ""
  }
]
