[
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section7/1.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section7/1.jpg",
    "description": ""
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section7/2.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section7/2.jpg",
    "description": "Reference checks and background verification are critical components in ensuring that the individuals we hire align with both the professional and ethical standards expected at Caelum. These steps not only protect the integrity of our recruitment process but also play a significant role in maintaining a safe and productive environment for our students and staff"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section7/3.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section7/3.jpg",
    "description": [
      "Obtaining References:",
      {
        "type": "para",
        "items": [
          "It is crucial to ask for references from candidates, specifically from previous employers, direct supervisors, or mentors who have observed their work first-hand. Encourage candidates to provide professional references who can speak about their work ethic, teaching style, and teamwork abilities. Research from the Society for Human Resource Management (SHRM) shows that 85% of employers who conducted reference checks reported improved hiring quality (SHRM, 2020). Thus, obtaining high-quality references is crucial for ensuring candidates are genuinely suited for the role."
        ]
      },
      {
        "type": "bullet",
        "items": [
          "Reference Form: Consistency while gathering feedback is very important. We have developed a standardized reference form that includes key questions aligned with the core competencies we value—such as empathy, collaboration, problem-solving, and classroom management. This will ensure that references are providing insights on the skills that matter most. This form focuses on how candidates interact with colleagues, students, and supervisors, their ability to inspire joy in learning, and their adaptability in challenging situations.",
          "Contacting References: While a reference form can provide a basic outline of the candidate's qualifications, a conversation can reveal more nuanced insights into their personality and how they would fit into Caelum's culture. For the same, contact references directly through phone or email. Schedule calls at times when the reference can speak openly and without distractions, ensuring a thorough and candid conversation.",
          "Open-Ended Questions: Use open-ended questions to encourage references to provide detailed, narrative-style feedback. Ask questions like:"
        ]
      },
      {
        "type": "bullet",
        "items": [
          "Can you describe how the candidate handled challenges in the classroom?",
          "How did the candidate contribute to creating a positive and collaborative learning environment?",
          "What do you believe are the candidate's greatest strengths and areas for improvement?"
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section7/4.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section7/4.jpg",
    "description": [
      {
        "type": "bullet",
        "items": [
          "Background Check Services: Utilize reputable and secure background check services to verify critical details, such as a candidate's education, employment history, and criminal record. A comprehensive background check will also help ensure that the candidate has the professional qualifications they claim and that there are no serious issues that might endanger the Caelum community. It's essential to work with services that offer global coverage, especially if candidates have worked or studied internationally, ensuring thorough verification across borders.",
          "Consent: Always obtain written consent from candidates before conducting any background checks, as per legal and ethical requirements. This ensures transparency in the hiring process and allows candidates to correct any potential discrepancies in advance. A candidate's willingness to provide consent is also a reflection of their confidence in their history and qualifications.",
          "Legal Compliance: Ensure compliance with local, national, and international laws regarding background checks. These may include regulations under data protection laws (such as the GDPR in Europe or the Data Protection Act in India) or specific provisions regarding the collection of sensitive information. Legal non-compliance can lead to costly legal challenges and undermine the credibility of the recruitment process.",
          "Reviewing Results: Carefully review the results of the background check, paying close attention to any red flags or discrepancies, such as employment gaps, inaccurate qualifications, or any criminal records. In the context of Caelum, where children's safety is paramount, any findings that raise concerns about the candidate's suitability should be investigated thoroughly. Even seemingly minor discrepancies can point to larger issues of integrity, which is non-negotiable for our school. For instance, if a criminal record check returns a minor offense, take the context and time frame into account before making a final decision. Engaging in a follow-up conversation with the candidate about these results may provide more clarity."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section7/5.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section7/5.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "In a 360-degree Reference Check, feedback is gathered from multiple sources—supervisors, colleagues, and students—to provide a comprehensive understanding of the candidate's skills, behavior, and cultural alignment with the Caelum Way. This holistic approach ensures that the feedback is not just limited to one perspective but covers different interactions in various environments.",
          "Multi-Sensory Engagement for a Richer Experience: This method leverages multi-sensory engagement, making the process more interactive, insightful, and aligned with Caelum's focus on emotional and intellectual growth."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section7/6.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section7/6.jpg",
    "description": [
      "Gather Feedback from Diverse Sources",
      {
        "type": "bullet",
        "items": [
          "Supervisors: Provide insight into the candidate's performance, leadership qualities, and ability to manage responsibilities.",
          "Colleagues: Offer a peer perspective on collaboration, teamwork, and professional interactions."
        ]
      },
      "Use of Visual and Auditory Feedback",
      {
        "type": "bullet",
        "items": [
          "Video Interviews: Conduct interviews with each reference via video calls. Encourage them to share personal anecdotes and examples that illustrate the candidate's alignment with Caelum's values, such as emotional intelligence, adaptability, and passion for education",
          "Audio Clips: Alternatively, references could submit voice recordings where they respond to specific questions about the candidate. This allows for greater nuance in tone and emotion, offering a deeper understanding of how the candidate performed in various roles."
        ]
      },
      "Interactive and Visual Feedback Forms",
      {
        "type": "bullet",
        "items": [
          "Provide references with an interactive form that includes visual elements such as sliders or rating scales. For example, use visual prompts for them to rate the candidate on:",
          "Collaboration and Teamwork: How effectively did the candidate work with others?",
          "Emotional Intelligence: Did the candidate demonstrate empathy and understanding in challenging situations?",
          "Problem-Solving: Was the candidate able to resolve conflicts or manage classroom disruptions with creativity?",
          "Incorporate infographics to summarise their feedback, creating a more dynamic and easy-to-interpret presentation of the candidate's overall fit."
        ]
      },
      "Sensory-Engaging Role-Play Scenarios for References",
      {
        "type": "bullet",
        "items": [
          "Ask the references to engage in role-play scenarios, narrating how the candidate handled specific situations, such as managing a difficult student or collaborating on a school-wide project. By asking them to relive those moments, you tap into their emotional and sensory memory, offering more vivid and insightful reflections."
        ]
      },
      "Use of Cultural Fit Rating Tools",
      {
        "type": "bullet",
        "items": [
          "Develop a digital rating system where references can assess how well the candidate's personality and teaching philosophy align with Caelum's culture. Use a colour-coded visual system (e.g., green for strong fit, yellow for moderate, red for potential issues) to provide quick insights into the candidate's cultural alignment."
        ]
      },
      "Group Feedback Sessions",
      {
        "type": "bullet",
        "items": [
          "After gathering individual feedback, host a group feedback session where references can discuss the candidate's strengths and areas for growth. This multi-sensory discussion could take place through video conferencing or in-person meetings, fostering dynamic conversation and allowing you to observe how different perspectives converge or diverge."
        ]
      },
      "Visualisation of Results",
      {
        "type": "bullet",
        "items": [
          "Once feedback is collected, create a 360-degree feedback chart that visually represents the various dimensions of the candidate's performance. This can include:",
          "Bar graphs: To show overall ratings in areas like teamwork, emotional intelligence, and adaptability",
          "Radar charts: To compare feedback across different sources, highlighting areas of consensus or divergence."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section7/7.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section7/7.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Empathy and Cultural Sensitivity: Did the candidate show an understanding of diverse perspectives and demonstrate inclusivity in their teaching approach?",
          "Collaboration and Teamwork: How well did they work with others in achieving shared goals?",
          "Emotional Intelligence: Did the candidate demonstrate the ability to manage their emotions and understand the emotions of others?",
          "Alignment with Caelum Way Values: Does the candidate's philosophy on education, teamwork, and personal growth align with the core values of Caelum?",
          "Reviewing and Integrating Feedback",
          "Carefully review the gathered feedback, identifying any patterns or key themes that emerge from multiple sources.",
          "Use the visual and sensory-rich feedback to create a more engaging presentation during hiring decisions, showing how well the candidate aligns with Caelum's educational philosophy and values."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section7/8.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section7/8.jpg",
    "description": "Ensuring Integrity, Passion, and Cultural Fit"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section7/9.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section7/9.jpg",
    "description": ""
  }
]
