[
  [
    {
      "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/16_9/1.jpg",
      "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/3_4/1.jpg",
      "description": [
        {
          "type": "para",
          "items": [
            "Selection and onboarding at Caelum represent the culmination of a thoughtfully curated recruitment journey, where every interaction is a step towards finding the right fit for both the teacher and the school. These final stages mark the beginning of a deeper, more meaningful relationship. They go beyond paperwork and formalities—they tap into the senses, ensuring that new hires feel, see, hear, and experience the essence of what it means to be part of the Caelum family.",
            "Effective selection and onboarding ensure that new hires are not only prepared to teach but also to immerse themselves in the Caelum Way. This section outlines how we can elevate these processes to bring the best talent into our community and ensure their success from day one."
          ]
        }
      ]
    },
    {
      "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/16_9/2.jpg",
      "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/3_4/2.jpg",
      "description": ""
    },
    {
      "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/16_9/3.jpg",
      "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/3_4/3.jpg",
      "description": [
        {
          "type": "para",
          "items": [
            "The selection process starts with Thorough Review and Comparison of Candidates",
            "When we sit down to review candidates as part of the final step, we don't just read resumes or listen to interview responses—we visualise classrooms, hearing the sound of a teacher's voice guiding curious minds, and sensing the energy they will bring to our community. Every detail of their application materials is like a snapshot of their future with us.,",
            "Studies show that organisations focusing on alignment with institutional values see a 32% increase in employee performance (Harvard Business Review, 2018). So, we focus not only on the facts but on how a candidate's values resonate with our own, ensuring that every aspect of their profile matches our expectations."
          ]
        }
      ]
    },
    {
      "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/16_9/4.jpg",
      "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/3_4/4.jpg",
      "description": [
        {
          "type": "para",
          "items": [
            "Imagine walking into a Caelum classroom: the atmosphere is buzzing with energy—laughter, conversation, and the soft shuffle of feet as students engage in play-based learning. This is what we want our teachers to feel in their hearts, too—a sense of belonging and connection.",
            "Research shows that 89% of hiring failures stem from poor cultural fit, not a lack of technical skills (LinkedIn Talent Solutions, 2017). As we assess candidates, we listen for their enthusiasm, their openness to collaboration, and their ability to adapt. We visualise them in the classroom, interacting with students, colleagues, and the curriculum, because for us what matters most is that you feel the pulse that Caelum beats on."
          ]
        }
      ]
    },
    {
      "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/16_9/5.jpg",
      "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/3_4/5.jpg",
      "description": [
        {
          "type": "para",
          "items": [
            "The final decision is based on a combination of factors—teaching skills, cultural fit, interpersonal qualities, and a demonstrated passion for our approach to education. Caelum seeks teachers who will not only excel in the classroom but also contribute to our wider school community.",
            "As we decide, we don't just ask, Can they teach?—we ask, Will they light up the room? Will they build trust with students? Will they embody the Caelum Way? The right candidate is one whose passion for education resonates in every interaction, ensuring they become an integral part of our community."
          ]
        }
      ]
    }
  ],
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/16_9/6.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/3_4/6.jpg",
    "description": "We plan an immersive, multisensory experience that welcomes new teachers into our world. The moment they accept an offer, they are greeted with the Caelum Welcome Packet. This isn't just a packet—it's a sensory experience that makes them feel part of the Caelum family."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/16_9/7.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/3_4/7.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "When new teachers step into the heartbeat of Caelum and attend the orientation, they aren't just learning policies—they're stepping into the rhythm of 'The Caelum Way'. The first day is filled with the hum of voices, the warmth of greetings from their new colleagues, and the palpable sense of excitement.",
          "The orientation program is designed to engage all their senses. Through interactive workshops, they feel the hands-on learning we implement in our classrooms, hear the stories from seasoned teachers about the Caelum Way, and see how emotional intelligence is woven into every lesson plan."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/16_9/8.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/3_4/8.jpg",
    "description": "Mentorship at Caelum is like having a guiding hand on your shoulder. The presence of a mentor is felt in every step a new teacher takes—from their first tentative lesson to their confident strides across the playground.\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/16_9/9.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/3_4/9.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Professional development is never static with Caelum—it's dynamic, constantly evolving to meet the needs of our teachers. Caelum is like walking into a workshop filled with bright visuals, hands-on learning tools, and the vibrant energy of educators collaborating and exchanging ideas.",
          "We firmly believe that professional development should engage all the senses, from visually rich presentations and auditory learning modules to tactile activities that mirror our approach in the classroom. The goal is not just to teach but to inspire and excite teachers, helping them feel empowered and connected to the larger educational community.",
          "We don't see the selection and onboarding process as just a sequence of steps but rather as a journey that engages the mind, heart, and all the senses. By carefully selecting individuals who align with our values and providing them with an immersive, sensory-rich onboarding experience, we ensure that our teachers are not only equipped for the classroom but also emotionally and intellectually connected to our mission.",
          "They are part of a community where every lesson, every interaction, and every experience is designed to spark curiosity, foster empathy, and inspire lifelong learning. By blending structured support with the Caelum Way's core values, we ensure that new hires not only understand their role but also embrace our holistic, child-centred approach to education. This creates a foundation where teachers feel valued, prepared, and inspired to foster both academic and emotional growth in their students."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/16_9/10.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/3_4/10.jpg",
    "description": [
      "To streamline the process, we use our Learning Management System (LMS) to ensure new hires are supported from the get-go. This system allows us to:",
      {
        "type": "bullet",
        "items": [
          "Candidate Tracking: Track each candidate's progress throughout the selection process, from initial interview stages to final onboarding. This ensures transparency and a seamless transition between recruitment phases.",
          "Offer Letter Generation: Offers can be generated electronically through the LMS, which simplifies the process and allows the HR team to store and manage offer documents efficiently.",
          "Onboarding Checklist: New hires are provided with an interactive checklist that guides them through their onboarding steps, from submitting paperwork to scheduling meetings with their mentor and attending orientation sessions. This checklist ensures nothing is overlooked and provides new employees with a clear path during their critical first weeks."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/16_9/11.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/3_4/11.jpg",
    "description": ""
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/16_9/12.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/3_4/12.jpg",
    "description": ""
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/16_9/13.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section8/3_4/13.jpg",
    "description": ""
  }
]
