[
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section6/1.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section6/1.jpg",
    "description": ""
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section6/2.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section6/2.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Most of us have heard the term 'Culture fit' thrown around at some point or another, but what does it really mean?",
          "Cultural fit plays a pivotal role in determining how well a new hire will integrate into the school's ecosystem. At Caelum, we believe that cultural fit is as important as teaching skills. Why? Because the Caelum Way isn't just about delivering lessons—it's about creating a nurturing, happy, and inclusive environment where both teachers and students can grow. ",
          "At Caelum, when we assess cultural fit, we are essentially asking one question: Does this person resonate with the principles of child-centeredness, empathy, emotional intelligence, and collaboration? We are not just hiring a teacher—we're bringing someone into a community that thrives on mutual respect, joy, and continuous learning."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section6/3.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section6/3.jpg",
    "description": [
      "The Caelum Way is rooted in core values that go beyond traditional academics. It's about teaching the whole child, helping them develop not only intellectually but emotionally and socially. Let's take a closer look at the key components that define this culture:",
      "Core Values and Principles:",
      {
        "type": "bullet",
        "items": [
          "Child-Centeredness: Everything we do revolves around the needs and well-being of the children. Teachers are not simply instructors; they are mentors who facilitate learning experiences.",
          "Play-Based Learning: We understand that play is a powerful vehicle for learning. It taps into children's natural curiosity and enthusiasm, fostering deeper engagement.",
          "Growth Mindset: Inspired by Carol Dweck's research, we believe in a culture where both students and staff view challenges as opportunities for growth, not as barriers. Those who align with this philosophy will thrive in our learning community.",
          "School Culture: Our culture is defined by a collaborative spirit, where teachers, parents, and students work together as a cohesive unit. Every stakeholder has a voice in shaping a joyful learning environment. We promote an atmosphere of empathy. Teachers are expected to be not just educators but emotional guides who understand each child's unique needs.",
          "Team Dynamics: Teamwork is at the heart of what we do. Whether it's co-teaching, planning cross-disciplinary projects, or leading school events, teachers who collaborate seamlessly will feel right at home here. Research from the Society for Human Resource Management (SHRM, 2019) reveals that effective teamwork enhances job satisfaction by 29%."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section6/4.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section6/4.jpg",
    "description": [
      "Assessing cultural fit goes beyond asking candidates about their experience. We focus on techniques that provide a holistic view of how a candidate might embody the Caelum Way. Some of the techniques we use include:",
      {
        "type": "bullet",
        "items": [
          "Behavioural-Based Interview Questions: We use past behaviour as a predictor of future performance. Questions like, Tell us about a time you had to work with a diverse group of students. How did you adapt your teaching? allow us to gauge a candidate's adaptability and inclusiveness—core aspects of the Caelum Way.",
          "Case Studies: We present hypothetical scenarios based on our unique approach. For example, candidates might be asked to design a lesson plan where play-based learning drives outcomes, or to respond to a situation where a child is struggling emotionally. Their responses give us a window into their values and teaching philosophy.",
          "Group Activities: Candidates participate in collaborative exercises with their peers, helping us observe how they communicate, share ideas, and support others. Teamwork is critical at Caelum, and this method lets us assess how well they would integrate into our dynamic environment.",
          "Cultural Sensitivity Assessments: In a school like Caelum, which fosters a global outlook while being deeply rooted in local values, cultural sensitivity is key. We use these assessments to understand how well a candidate can navigate and respect cultural differences—a quality especially vital in a multicultural classroom."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section6/5.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section6/5.jpg",
    "description": [
      "While each candidate brings their unique strengths, certain traits and behaviors indicate a stronger cultural fit at Caelum:",
      {
        "type": "bullet",
        "items": [
          "Shared Values: Research from the Corporate Leadership Council (2020) indicates that employees who share the same values as their workplace are 32% more committed and 24% more likely to exceed performance expectations. In the context of Caelum, we look for candidates who embrace holistic learning, emotional well-being, and child-centered approaches.",
          "Positive Attitude: A positive mindset isn't just about enthusiasm—it's about resilience and a love for learning. At Caelum, we foster a culture of optimism where teachers encourage students to view challenges as opportunities.",
          "Teamwork Skills: We expect our educators to not only work well independently but also to thrive in teams. Collaborative learning, both among students and staff, is a core pillar of our educational philosophy. Teachers who demonstrate strong collaboration skills are more likely to contribute to the vibrant, interconnected community we nurture here.",
          "Flexibility and Adaptability: The nature of teaching is fluid, and at Caelum, teachers must be able to pivot and adapt to new methods, ideas, and technologies. Candidates who demonstrate flexibility are better suited to our environment, where we embrace innovative practices and continuous improvement."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section6/6.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section6/6.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "Flexibility and Adaptability: The nature of teaching is fluid, and at Caelum, teachers must be able to pivot and adapt to new methods, ideas, and technologies. Candidates who demonstrate flexibility are better suited to our environment, where we embrace innovative practices and continuous improvement.",
          "Candidates who will succeed at Caelum will not only be great educators but also people who make learning a joyous experience, who see children for their potential rather than their limitations, and who walk into the school each day ready to build a future filled with empathy, curiosity, and boundless possibilities.",
          "By investing time and effort in assessing cultural fit, we ensure that the teachers we hire are not only aligned with our mission but are also passionate about living the Caelum Way every day."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section6/7.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section6/7.jpg",
    "description": "Through investing in cultural fit, we ensure that every educator embodies the Caelum Way, creating classrooms where empathy, curiosity, and growth flourish."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section6/8.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/3_4/Section6/8.jpg",
    "description": ""
  }
]
