[
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 5/1.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 5/1.jpg",
    "description": "In the heart of every classroom, every hallway, and every team meeting, there's a conversation happening. Conversation about growth, about what works, and about how Caelum can do better. This section explores how we take those conversations and turn them into meaningful changes that enhance both our teachers' professional journeys and our students' educational experiences. A well-structured evaluation process is essential for building and maintaining high-quality professional development (PD) programs in schools. Teacher feedback is at the core of continuous improvement, and our feedback processes are designed to be engaging, personal, and highly relatable for our educators. "
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 5/2.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 5/2.jpg",
    "description": [
      "Activity 1: Teacher Surveys – Listening to Our Voices",
      "Engaging teachers in feedback is a key component of how Caelum grows together. Research shows that teachers who feel heard are 22% more likely to stay in their positions, leading to higher teacher retention rates (Teacher Voice Survey, 2022). Our teacher surveys are designed to be thoughtful and encourage reflection:",
      "Survey Template:",
      {
        "type": "para",
        "items": [
          "Satisfaction with Professional Development (PD) opportunities so that teachers can express their satisfaction and provide details about which aspects they found particularly beneficial. Eg.  'How well did the PD sessions address your personal growth areas as a teacher?'",
          "It is essential to assess the effectiveness of Training Sessions:  'Were you able to implement strategies from the sessions into your classroom practice? If so, what impact did they have on student engagement or understanding?'",
          "There is always scope for improvement. Questions like, 'What more could we offer to support your professional journey?' can help us understand better."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 5/3.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 5/3.jpg",
    "description": [
      "Activity 2: Focus Groups – Learning Through Dialogue",
      "According to a study by the National Center for Education Statistics (2020), schools that utilise focus groups report a 30% higher rate of meaningful PD adjustments because they allow teachers to express real-time challenges and suggestions for improvement. Focus groups foster open, dynamic conversations among teachers. These small group discussions provide a space for educators to voice their thoughts on a deeper level, beyond what they can convey in surveys.",
      "Discussion Topics:  ",
      {
        "type": "para",
        "items": [
          "Effectiveness of Training Sessions: 'What strategies from the PD training did you find most relevant to your current challenges in the classroom?'",
          "Barriers to Professional Development: Were there any barriers (time, resources, content)"
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 5/4.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 5/4.jpg",
    "description": [
      "Activity 3: Observations – Bringing Practice to Life",
      "Observations are a powerful tool for assessing the actual implementation of Caelum Way strategies. Instead of a one-size-fits-all approach, we tailor our observation feedback to each teacher's individual goals and growth areas. Our observation rubrics focus not just on academic delivery but on how well teachers embody our holistic, child-centred philosophy. A study by the Teaching and Learning International Survey (TALIS, 2021) shows that structured, growth-focused observations can lead to a 15% improvement in teachers' instructional practices, particularly when feedback is designed to support and develop the teacher.",
      "Observation Rubric:",
      {
        "type": "para",
        "items": [
          "Implementation of Caelum Principles:  'Is the teacher using student-centred strategies, such as inquiry-based learning, that reflect Caelum's core educational values?'",
          "Classroom Management:  'How effectively is the teacher fostering a positive, emotionally supportive learning environment?'"
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 5/5.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 5/5.jpg",
    "description": [
      "Data Analysis – Finding the Story in the Numbers",
      "After surveys, focus groups, and observations are complete, the next step is to analyse the data to identify trends. Caelum believes in looking at feedback holistically, ensuring that all data—from both qualitative and quantitative sources—is used to drive decisions.",
      "Steps for Data Analysis:",
      {
        "type": "para",
        "items": [
          "Survey Data: We analyse survey responses to spot patterns. If 75% of teachers express a desire for more tech-based PD, it shows us where to prioritise resources.",
          "Qualitative Feedback: Focus group transcripts are reviewed to identify common themes like classroom management, workload stress, or technology integration.",
          "Cross-Referencing Data: If focus groups reveal that teachers are struggling with a particular teaching strategy, and classroom observations confirm it, we can take targeted action."
        ]
      },
      "By diversifying professional development formats, schools can accommodate different learning styles and ensure teachers remain engaged and motivated."
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 5/6.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 5/6.jpg",
    "description": [
      "Action Planning – Turning Feedback Into Action",
      "With a clear understanding of the data, the next step is to develop actionable goals that align with our findings.",
      "Steps for Action Planning:",
      {
        "type": "para",
        "items": [
          "Specific Goals Based on feedback, we might set a goal like, Increase the number of hands-on PD workshops by 50% within the next six months.",
          "Timeline: Each action plan comes with a clear timeline for implementation, ensuring accountability and timely progress.",
          "Monitor Progress: Regular check-ins will help us monitor whether changes are improving the desired outcomes, making adjustments as needed."
        ]
      },
      "By diversifying professional development formats, schools can accommodate different learning styles and ensure teachers remain engaged and motivated."
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 5/7.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 5/7.jpg",
    "description": [
      "Activity 3: Observations – Bringing Practice to Life",
      "Observations are a powerful tool for assessing the actual implementation of Caelum Way strategies. Instead of a one-size-fits-all approach, we tailor our observation feedback to each teacher's individual goals and growth areas. Our observation rubrics focus not just on academic delivery but on how well teachers embody our holistic, child-centred philosophy. A study by the Teaching and Learning International Survey (TALIS, 2021) shows that structured, growth-focused observations can lead to a 15% improvement in teachers' instructional practices, particularly when feedback is designed to support and develop the teacher.",
      "Observation Rubric:",
      {
        "type": "para",
        "items": [
          "Implementation of Caelum Principles:  'Is the teacher using student-centred strategies, such as inquiry-based learning, that reflect Caelum's core educational values?'",
          "Classroom Management:  'How effectively is the teacher fostering a positive, emotionally supportive learning environment?'"
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 5/8.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 5/8.jpg",
    "description": [
      "Relatability and Connection – Why This Matters for Us",

      {
        "type": "para",
        "items": [
          "What makes our approach unique is its emphasis on creating real connections. By involving teachers in the evaluation process, Caelum gives them ownership of their growth. By focusing on teacher satisfaction, collaboration, and continual growth, Caelum ensures that its professional development programs stay relevant, effective, and most importantly, supportive of our teachers' unique needs. This not only fosters a culture of excellence but also ensures that our students receive the best education possible. "
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/teachersTraining/16_9/Section 5/9.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/teachersTraining/3_4/Section 5/9.jpg",
    "description": ""
  }
]
