[
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 6/1.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 6/1.jpg",
    "description": "Compliance with labour laws is essential to upholding a legal, ethical, and harmonious workplace environment. Labour regulations compliance is not merely about fulfilling statutory requirements but about fostering a fair, secure, and supportive culture where employees feel valued. A recent report by the International Labour Organization (ILO) highlights that schools and organisations adhering to labour laws report 30% higher staff retention and satisfaction, particularly in sectors with direct community engagement like education.\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 6/2.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 6/2.jpg",
    "description": "This Act governs the framework for resolving disputes between employers and employees, covering trade unions, strikes, and lockouts. It is instrumental in managing industrial relations, particularly in education, where fair practices and grievance redressal are crucial. Educational institutions compliant with this Act often report a smoother resolution process for conflicts as it protects both educators and administrative staff from unfair practices while safeguarding their rights to organise or seek redress, fostering trust among staff and management. The Industrial Disputes Act plays a central role in managing industrial relations in India. In a study by the National Institute of Labour Economics, educational organisations that implement this Act effectively report up to a 40% reduction in workplace conflicts, highlighting the importance of proactive dispute resolution. The Maharashtra Teachers Association recently invoked this Act to negotiate fairer working hours for teachers in private schools, showing how compliance with the Act not only ensures fairness but also fosters a more positive, productive working environment.\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 6/3.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 6/3.jpg",
    "description": "Mandating fair compensation for employees across industries, this Act ensures a baseline for financial equity. Schools compliant with this Act often see increased job satisfaction and retention, as fair pay directly influences employee morale. A PayScale survey reports a 25% increase in employee satisfaction in organisations that adhere to minimum wage standards, underscoring Caelum’s commitment to fair wages as a core element of staff well-being. This is particularly important in the educational sector, where salary standards can vary significantly. This Act’s adherence demonstrates a commitment to equitable pay and improved employee morale. Caelum follows and often goes beyond minimum wage laws to guarantee that all staff are fairly compensated for their contributions, aligning with both legal and ethical standards.\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 6/4.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 6/4.jpg",
    "description": "The EPF Act requires employers to contribute to a provident fund for employees, helping them secure a stable financial future. This is particularly critical in education, where long-term service and stability are valued. Research from the Employees’ Provident Fund Organization (EPFO) shows that EPF benefits can enhance an employee’s retirement security, leading to a 30% increase in employee retention among those nearing retirement age. Caelum’s provident fund policy is designed to provide long-term financial security, which helps foster loyalty among teaching and administrative staff."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 6/5.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 6/5.jpg",
    "description": "Employee well-being is as crucial to a school as it is to any organisation. Providing benefits like ESI doesn’t just meet legal standards—it builds a foundation of trust and loyalty.” — Priya Bhatia, HR expert in the education sector. The ESI Act provides social security benefits, such as healthcare and medical support for employees and their families. At Caelum, compliance with this Act ensures our employees have access to essential healthcare, reducing absenteeism and fostering a supportive work culture. The World Health Organization reports that companies providing healthcare benefits see a 20% reduction in employee stress levels, directly correlating to improved job performance and satisfaction."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 6/6.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 6/6.jpg",
    "description": "Enacted to protect employees from harassment, this Act mandates organisations to create a safe working environment. Compliance includes establishing Internal Complaints Committees (ICCs) and conducting awareness programs. According to a study by the Centre for Policy Research, workplaces actively enforcing this Act report 50% lower incidents of harassment and increased employee morale, especially in female-dominated fields like education. Caelum emphasises strict adherence to this Act, ensuring every staff member feels safe, respected, and empowered to speak out. The Supreme Court case Vishaka vs. State of Rajasthan was pivotal in the establishment of this law, which has since become a fundamental pillar of workplace safety. Schools like Caelum model their policies around this landmark case to ensure comprehensive protections. Instituted to combat workplace harassment, this Act mandates organisations to establish Internal Complaints Committees and conduct regular awareness programs. For educational institutions, adherence to this Act fosters a safe and inclusive environment, essential for both staff and students. Caelum’s strict compliance ensures all employees are protected and can report issues safely. Data from the Centre for Policy Research shows that workplaces actively enforcing this Act report significantly fewer harassment incidents, reflecting its critical role in building a safe workplace culture.\r\n"
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 6/7.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 6/7.jpg",
    "description": [
      "Regular Updates on Legal Changes:",
      {
        "type": "para",
        "items": [
          "Education sector laws are frequently updated, and staying informed is crucial. A study by the National Labour Law Association found that schools updating their policies annually see a 35% decrease in legal complications. Caelum partners with legal experts to ensure our policies align with the latest regulations."
        ]
      },
      "Legal Consultation and Audits:",
      {
        "type": "para",
        "items": [
          "Consulting legal experts helps us ensure that all aspects of labour law compliance are met. Regular legal audits also enable us to proactively identify areas for improvement, building a well-organised foundation with transparency and fairness."
        ]
      },
      "Accurate Record Keeping:",
      {
        "type": "para",
        "items": [
          "Accurate and secure record-keeping is vital for tracking employee information, wages, and benefits. In a study by Deloitte, organisations with strong record-keeping practices report 20% higher trust from employees. Caelum’s digital record-keeping system allows us to meet legal standards while enhancing data security and accessibility."
        ]
      },
      "Training and Awareness:",
      {
        "type": "para",
        "items": [
          "Regular training sessions for both staff and management improve awareness and compliance with labour laws. Data from the Society for Human Resource Management (SHRM) shows that 60% of compliance issues are resolved by increasing employee knowledge of their rights and responsibilities. At Caelum, these sessions foster an informed and empowered workforce, creating a culture of transparency."
        ]
      },
      "Internal Grievance Mechanism:",
      {
        "type": "para",
        "items": [
          "An accessible grievance mechanism encourages employees to report any violations or concerns without fear of retaliation. According to the Labour Bureau of India, companies with effective grievance mechanisms see a 25% reduction in turnover. Caelum has established an internal grievance process that ensures all concerns are addressed fairly and transparently, promoting a supportive environment."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 6/8.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 6/8.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "In 2020, the educational institution XYZ Academy in Bangalore faced legal action for wage and overtime discrepancies. This case highlighted the importance of regular compliance checks and led them to introduce updated training programs and wage policies. Following this, XYZ Academy saw a substantial improvement in employee morale and job satisfaction. Caelum aims to avoid such pitfalls by ensuring compliance with all labor laws, underscoring our commitment to integrity and employee welfare.",
          "Through these compliance measures, Caelum exemplifies a balanced, proactive approach that promotes employee rights, builds trust, and maintains our commitment to educational excellence. Compliance isn’t just about meeting standards; it’s about setting a precedent for an equitable, fair, and productive work environment—one that truly reflects the values of the Caelum Way."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/hr/hrPolicies/16_9/Section 6/9.jpg",
    "imageMobile": "/assets/learning_resource_data/hr/hrPolicies/3_4/Section 6/9.jpg",
    "description": ""
  }
]
