[
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section3/1.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section3/3_4/1.jpg",
    "description": ""
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section3/2.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section3/3_4/2.jpg",
    "description": "The Caelum Way is built on the belief that happiness is non-negotiable—for students, teachers, staff, and everyone connected to the school. This philosophy must transcend the realm of thought and influence day-to-day operations. It begins with a strategic approach to recruitment. Effective recruitment is one of the most powerful means of safeguarding this ethos. The right educators not only excel in their subject matter but also foster a nurturing, joyful environment. Studies have shown that teachers' well-being directly influences student outcomes; when teachers are satisfied, their students demonstrate higher engagement and academic achievement (Journal of Educational Psychology). By hiring individuals who value emotional intelligence, empathy, and a passion for student development, Caelum ensures both students and staff thrive in a balanced, supportive community."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section3/3.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section3/3_4/3.jpg",
    "description": "While good hiring builds a school’s culture, poor hiring decisions can be incredibly detrimental. Studies indicate that 40% of new hires fail within the first 18 months due to poor fit or inadequate skills, impacting not just the new employee but the entire school ecosystem. Turnover disrupts student learning, damages staff morale, and weakens the institution's culture. Financially, poor hiring is costly—averaging more than ₹3,35,820.40 ($4,000) per hire (Society for Human Resource Management). But the emotional toll—lost productivity, eroded trust—can be far more damaging. This is why at Caelum, we focus on building a strong foundation through an effective recruitment process, ensuring that we attract top talent."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section3/4.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section3/3_4/4.jpg",
    "description": [
      "Maximising Visibility on Trusted Platforms",
      {
        "type": "bullet",
        "items": [
          "Job Boards: We post job openings on popular platforms like Indeed and Glassdoor, ensuring our positions reach a large pool of potential candidates.",
          "Educational Institutions: We actively engage local universities and colleges by participating in job fairs and campus events, ensuring a steady flow of both recent graduates and experienced educators.",
          "Professional Networks: Our connections within educational associations help us identify and engage with qualified candidates."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section3/5.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section3/3_4/5.jpg",
    "description": " Employee referrals are a crucial component of our strategy. Referred employees are typically 55% faster to hire and have 25% lower turnover rates. This method helps us find candidates who are already aligned with our values through trusted recommendations from within our network.\r\n  "
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section3/6.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section3/3_4/6.jpg",
    "description": " In today’s digital age, social media and content marketing play a pivotal role in recruitment. We leverage platforms like LinkedIn, Facebook, and Twitter to promote our job openings and share posts that highlight Caelum’s culture and values, reaching a broad, engaged audience. Through content marketing, including blog posts and videos showcasing our educational philosophy, we attract interest from educators who resonate with our mission."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section3/7.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section3/3_4/7.jpg",
    "description": "Our employer brand is essential to attracting top talent. On our website, we feature testimonials from current employees and highlight the school’s culture of happiness and growth. Research suggests that a strong employer brand leads to 50% more qualified applicants."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section3/8.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section3/3_4/8.jpg",
    "description": [
      "Implementing Targeted Recruitment Strategies",
      {
        "type": "bullet",
        "items": [
          "Diversity and Inclusion: We implement strategies to ensure our hiring process promotes a culture of inclusion. Companies with more diverse workforces are 33% more likely to outperform their competitors (McKinsey & Company).",
          "Attracting Experienced Educators: We target seasoned educators with proven success, ensuring that our hires not only meet the academic expectations of the ICSE curriculum but also embody the Caelum Way."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section3/9.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section3/3_4/9.jpg",
    "description": [
      {
        "type": "para",
        "items": [
          "While attracting a broad pool of applicants is important, having an effective assessment and selection process is crucial for identifying the right fit.",
          "Thanks to our effective recruitment strategies, we receive a high volume of applications. Then, to narrow down our candidate pool, we screen applications based on candidates' experience and previous workplaces. This method helps us identify individuals who not only meet our baseline qualifications but also possess the desired background to thrive in our happy school environment.",
          "Shortlisted candidates are then invited for in-person interviews, where we delve deeper into their qualifications and experiences. During these interviews, we assess not only their technical skills but also their interpersonal abilities and cultural fit within our happy school. We create a welcoming environment that encourages open dialogue, allowing candidates to express their teaching philosophies and passion for education."
        ]
      }
    ]
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section3/10.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section3/3_4/10.jpg",
    "description": "Following the in-person interviews, candidates participate in a classroom trial where they teach a lesson to a group of students. Both the interviewing teacher and the subject teacher attend this trial, providing valuable feedback on the candidate’s performance. Candidates are encouraged to bring their own PowerPoint presentations or props to enhance their lesson delivery. The school promotes interactive sessions, allowing candidates to demonstrate their ability to engage students actively. This observation enables us to assess their teaching style, classroom management, and ability to connect with students."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section3/11.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section3/3_4/11.jpg",
    "description": "To ensure a comprehensive evaluation, we conduct thorough reference checks for our top candidates. We verify the information provided and seek insights from previous employers and colleagues, gathering a well-rounded perspective on the candidate's work ethic, character, and interpersonal skills. This step is vital in confirming that the candidate's background aligns with the standards we uphold at our happy school. Research from the Harvard Business Review suggests that reference checks can reduce the risk of hiring mistakes by up to 30%."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section3/12.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section3/3_4/12.jpg",
    "description": "Recruitment is the foundation of our school’s culture of happiness. Every step of the hiring process is a reflection of our commitment to well-being, growth, and collaboration."
  },
  {
    "imageDesktop": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/16_9/Section3/13.jpg",
    "imageMobile": "/assets/learning_resource_data/recruitment/recruitmentAndSelection/Section3/3_4/13.jpg",
    "description": ""
  }
]
